nguyentri/nuttx/arch/arm/src/ra8/hardware/ra8e1/ra8e1_pinmap.h
/* SCI1 Alternative Functions */
#define GPIO_RXD1_MISO1_SCL1_A              (gpio_pinset_t){ PORT4,PIN1, (PFS_PSEL_SCI | R_PFS_PMR)}
#define GPIO_TXD1_MOSI1_SDA1_A              (gpio_pinset_t){ PORT4,PIN0, (PFS_PSEL_SCI | R_PFS_PMR)}
#define GPIO_RXD1_MISO1_SCL1_B              (gpio_pinset_t){ PORT2,PIN12, (PFS_PSEL_SCI | R_PFS_PMR)}
#define GPIO_TXD1_MOSI1_SDA1_B              (gpio_pinset_t){ PORT2,PIN13, (PFS_PSEL_SCI | R_PFS_PMR)}
#define GPIO_RXD1_MISO1_SCL1_C              (gpio_pinset_t){ PORT5,PIN12, (PFS_PSEL_SCI | R_PFS_PMR)}
#define GPIO_TXD1_MOSI1_SDA1_C              (gpio_pinset_t){ PORT5,PIN11, (PFS_PSEL_SCI | R_PFS_PMR)}

/* SCI2 Alternative Functions */
#define GPIO_RXD2_MISO2_SCL2_A              (gpio_pinset_t){ PORT8,PIN2, (PFS_PSEL_SCI | R_PFS_PMR)}
#define GPIO_TXD2_MOSI2_SDA2_A              (gpio_pinset_t){ PORT8,PIN1, (PFS_PSEL_SCI | R_PFS_PMR)}
#define GPIO_RXD2_MISO2_SCL2_B              (gpio_pinset_t){ PORT7,PIN0, (PFS_PSEL_SCI | R_PFS_PMR)}
#define GPIO_TXD2_MOSI2_SDA2_B              (gpio_pinset_t){ PORT4,PIN5, (PFS_PSEL_SCI | R_PFS_PMR)}

/* SCI3 Alternative Functions */
#define GPIO_RXD3_MISO3_SCL3_A              (gpio_pinset_t){ PORT4,PIN8, (PFS_PSEL_SCI | R_PFS_PMR)}
#define GPIO_TXD3_MOSI3_SDA3_A              (gpio_pinset_t){ PORT4,PIN9, (PFS_PSEL_SCI | R_PFS_PMR)}
#define GPIO_RXD3_MISO3_SCL3_B              (gpio_pinset_t){ PORT3,PIN9, (PFS_PSEL_SCI | R_PFS_PMR)}
#define GPIO_TXD3_MOSI3_SDA3_B              (gpio_pinset_t){ PORT3,PIN10, (PFS_PSEL_SCI | R_PFS_PMR)}

/* SCI4 Alternative Functions */
#define GPIO_SCK4_A                         (gpio_pinset_t){ PORT2,PIN4, (PFS_PSEL_SCI | R_PFS_PMR)}
#define GPIO_SCK4_B                         (gpio_pinset_t){ PORT7,PIN8, (PFS_PSEL_SCI | R_PFS_PMR)}

#define GPIO_TXD4_MOSI4_SDA4_A              (gpio_pinset_t){ PORT2,PIN5, (PFS_PSEL_SCI | R_PFS_PMR)}
#define GPIO_TXD4_MOSI4_SDA4_B              (gpio_pinset_t){ PORT4,PIN15, (PFS_PSEL_SCI | R_PFS_PMR)}

#define GPIO_RXD4_MISO4_SCL4_A              (gpio_pinset_t){ PORT2,PIN6, (PFS_PSEL_SCI | R_PFS_PMR)}
#define GPIO_RXD4_MISO4_SCL4_B              (gpio_pinset_t){ PORT4,PIN14, (PFS_PSEL_SCI | R_PFS_PMR)}

#define GPIO_CTS_RTS4_SS4_A                 (gpio_pinset_t){ PORT4,PIN3, (PFS_PSEL_SCI | R_PFS_PMR)}
#define GPIO_CTS_RTS4_SS4_B                 (gpio_pinset_t){ PORT7,PIN9, (PFS_PSEL_SCI | R_PFS_PMR)}

#define GPIO_CTS4_A                         (gpio_pinset_t){ PORT4,PIN8, (PFS_PSEL_SCI | R_PFS_PMR)}
#define GPIO_CTS4_B                         (gpio_pinset_t){ PORT7,PIN10, (PFS_PSEL_SCI | R_PFS_PMR)}

/* SCI9 Alternative Functions */
#define GPIO_RXD9_MISO9_SCL9_A              (gpio_pinset_t){ PORT1,PIN1, (PFS_PSEL_SCI | R_PFS_PMR)}
#define GPIO_TXD9_MOSI9_SDA9_A              (gpio_pinset_t){ PORT1,PIN2, (PFS_PSEL_SCI | R_PFS_PMR)}
#define GPIO_RXD9_MISO9_SCL9_B              (gpio_pinset_t){ PORT2,PIN8, (PFS_PSEL_SCI | R_PFS_PMR)}
#define GPIO_TXD9_MOSI9_SDA9_B              (gpio_pinset_t){ PORT2,PIN9, (PFS_PSEL_SCI | R_PFS_PMR)}
#define GPIO_SCK9_A                         (gpio_pinset_t){ PORT1,PIN0, (PFS_PSEL_SCI | R_PFS_PMR)}
#define GPIO_SCK9_B                         (gpio_pinset_t){ PORT2,PIN11, (PFS_PSEL_SCI | R_PFS_PMR)}
#define GPIO_CTS9_RTS9_A                    (gpio_pinset_t){ PORT1,PIN3, (PFS_PSEL_SCI | R_PFS_PMR)}
#define GPIO_CTS9_RTS9_B                    (gpio_pinset_t){ PORT2,PIN10, (PFS_PSEL_SCI | R_PFS_PMR)}
#define GPIO_CTS9_A                         (gpio_pinset_t){ PORT1,PIN4, (PFS_PSEL_SCI | R_PFS_PMR)}
#define GPIO_CTS9_B                         (gpio_pinset_t){ PORT3,PIN8, (PFS_PSEL_SCI | R_PFS_PMR)}

/* SPI/SCI Alternative Functions for SPI0 */
#define GPIO_SCK0_A                         (gpio_pinset_t){ PORT3,PIN0, (PFS_PSEL_SCI | R_PFS_PMR)}
#define GPIO_SCK0_B                         (gpio_pinset_t){ PORT6,PIN1, (PFS_PSEL_SCI | R_PFS_PMR)}
#define GPIO_SCK0_C                         (gpio_pinset_t){ PORT6,PIN11, (PFS_PSEL_SCI | R_PFS_PMR)}

#define GPIO_MOSI0_TXD0_SDA0_A              (gpio_pinset_t){ PORT1,PIN12, (PFS_PSEL_SCI | R_PFS_PMR)}
#define GPIO_MOSI0_TXD0_SDA0_B              (gpio_pinset_t){ PORT6,PIN3, (PFS_PSEL_SCI | R_PFS_PMR)}
#define GPIO_MOSI0_TXD0_SDA0_C              (gpio_pinset_t){ PORT6,PIN9, (PFS_PSEL_SCI | R_PFS_PMR)}

#define GPIO_MISO0_RXD0_SCL0_A              (gpio_pinset_t){ PORT1,PIN13, (PFS_PSEL_SCI | R_PFS_PMR)}
#define GPIO_MISO0_RXD0_SCL0_B              (gpio_pinset_t){ PORT6,PIN2, (PFS_PSEL_SCI | R_PFS_PMR)}
#define GPIO_MISO0_RXD0_SCL0_C              (gpio_pinset_t){ PORT6,PIN10, (PFS_PSEL_SCI | R_PFS_PMR)}

#define GPIO_SS0_CTS_RTS0_A                 (gpio_pinset_t){ PORT1,PIN14, (PFS_PSEL_SCI | R_PFS_PMR)}
#define GPIO_SS0_CTS_RTS0_B                 (gpio_pinset_t){ PORT6,PIN4, (PFS_PSEL_SCI | R_PFS_PMR)}
#define GPIO_SS0_CTS_RTS0_C                 (gpio_pinset_t){ PORT6,PIN12, (PFS_PSEL_SCI | R_PFS_PMR)}

#define GPIO_CTS0_A                         (gpio_pinset_t){ PORT1,PIN15, (PFS_PSEL_SCI | R_PFS_PMR)}
#define GPIO_CTS0_B                         (gpio_pinset_t){ PORT6,PIN5, (PFS_PSEL_SCI | R_PFS_PMR)}
#define GPIO_CTS0_C                         (gpio_pinset_t){ PORT6,PIN13, (PFS_PSEL_SCI | R_PFS_PMR)}

/* SPI Alternative Functions for Group B */
#define GPIO_MISOB_A                        (gpio_pinset_t){ PORT1,PIN0, (PFS_PSEL_SPI | R_PFS_PMR)}
#define GPIO_MISOB_B                        (gpio_pinset_t){ PORT4,PIN10, (PFS_PSEL_SPI | R_PFS_PMR)}

#define GPIO_MOSIB_A                        (gpio_pinset_t){ PORT1,PIN15, (PFS_PSEL_SPI | R_PFS_PMR)}
#define GPIO_MOSIB_B                        (gpio_pinset_t){ PORT4,PIN11, (PFS_PSEL_SPI | R_PFS_PMR)}

#define GPIO_RSPCKB_A                       (gpio_pinset_t){ PORT1,PIN2, (PFS_PSEL_SPI | R_PFS_PMR)}
#define GPIO_RSPCKB_B                       (gpio_pinset_t){ PORT4,PIN12, (PFS_PSEL_SPI | R_PFS_PMR)}

#define GPIO_SSLB0_B                        (gpio_pinset_t){ PORT4,PIN13, (PFS_PSEL_SPI | R_PFS_PMR)}

/* SPI SSL Alternative Functions */
#define GPIO_SSLA0_A                        (gpio_pinset_t){ PORT2,PIN4, (PFS_PSEL_SPI | R_PFS_PMR)}
#define GPIO_SSLA0_B                        (gpio_pinset_t){ PORT1,PIN14, (PFS_PSEL_SPI | R_PFS_PMR)}
#define GPIO_SSLA0_C                        (gpio_pinset_t){ PORT7,PIN3, (PFS_PSEL_SPI | R_PFS_PMR)}
#define GPIO_SSLA1_A                        (gpio_pinset_t){ PORT2,PIN5, (PFS_PSEL_SPI | R_PFS_PMR)}
#define GPIO_SSLA1_B                        (gpio_pinset_t){ PORT1,PIN13, (PFS_PSEL_SPI | R_PFS_PMR)}
#define GPIO_SSLA1_C                        (gpio_pinset_t){ PORT7,PIN4, (PFS_PSEL_SPI | R_PFS_PMR)}
#define GPIO_SSLA2_A                        (gpio_pinset_t){ PORT2,PIN6, (PFS_PSEL_SPI | R_PFS_PMR)}
#define GPIO_SSLA2_B                        (gpio_pinset_t){ PORT1,PIN12, (PFS_PSEL_SPI | R_PFS_PMR)}
#define GPIO_SSLA2_C                        (gpio_pinset_t){ PORT7,PIN5, (PFS_PSEL_SPI | R_PFS_PMR)}
#define GPIO_SSLA3_A                        (gpio_pinset_t){ PORT4,PIN7, (PFS_PSEL_SPI | R_PFS_PMR)}
#define GPIO_SSLA3_B                        (gpio_pinset_t){ PORT3,PIN0, (PFS_PSEL_SPI | R_PFS_PMR)}
#define GPIO_SSLA3_C                        (gpio_pinset_t){ PORT4,PIN6, (PFS_PSEL_SPI | R_PFS_PMR)}
#define GPIO_SSLB0_A                        (gpio_pinset_t){ PORT1,PIN3, (PFS_PSEL_SPI | R_PFS_PMR)}
#define GPIO_SSLB1_A                        (gpio_pinset_t){ PORT1,PIN4, (PFS_PSEL_SPI | R_PFS_PMR)}
#define GPIO_SSLB1_B                        (gpio_pinset_t){ PORT4,PIN14, (PFS_PSEL_SPI | R_PFS_PMR)}
#define GPIO_SSLB2_A                        (gpio_pinset_t){ PORT1,PIN5, (PFS_PSEL_SPI | R_PFS_PMR)}
#define GPIO_SSLB2_B                        (gpio_pinset_t){ PORT4,PIN15, (PFS_PSEL_SPI | R_PFS_PMR)}
#define GPIO_SSLB3_A                        (gpio_pinset_t){ PORT1,PIN6, (PFS_PSEL_SPI | R_PFS_PMR)}
#define GPIO_SSLB3_B                        (gpio_pinset_t){ PORT7,PIN8, (PFS_PSEL_SPI | R_PFS_PMR)}

/* I2C Alternative Functions */
#define GPIO_SDA0_A                         (gpio_pinset_t){ PORT4,PIN9, (PFS_PSEL_IIC | R_PFS_PMR)}
#define GPIO_SDA0_B                         (gpio_pinset_t){ PORT4,PIN7, (PFS_PSEL_IIC | R_PFS_PMR)}
#define GPIO_SCL0_A                         (gpio_pinset_t){ PORT4,PIN10, (PFS_PSEL_IIC | R_PFS_PMR)}
#define GPIO_SCL0_B                         (gpio_pinset_t){ PORT4,PIN8, (PFS_PSEL_IIC | R_PFS_PMR)}

#define GPIO_SDA1_A                         (gpio_pinset_t){ PORT5,PIN11, (PFS_PSEL_IIC | R_PFS_PMR)}
#define GPIO_SDA1_B                         (gpio_pinset_t){ PORT2,PIN6, (PFS_PSEL_IIC | R_PFS_PMR)}
#define GPIO_SCL1_A                         (gpio_pinset_t){ PORT5,PIN12, (PFS_PSEL_IIC | R_PFS_PMR)}
#define GPIO_SCL1_B                         (gpio_pinset_t){ PORT2,PIN5, (PFS_PSEL_IIC | R_PFS_PMR)}

/* Special Pin Functions */
#define GPIO_NMI                            (gpio_pinset_t){ PORT2,PIN0, (0)}
#define GPIO_MD                             (gpio_pinset_t){ PORT2,PIN1, (0)}

