nguyentri/nuttx/arch/arm/src/ra8/hardware/ra8e1/ra8e1_pinmap.h
#define GPIO_GTIOC0A_1                      (gpio_pinset_t){ PORT2,PIN11, (PFS_PSEL_GPT | R_PFS_PMR)}
#define GPIO_GTIOC0A_2                      (gpio_pinset_t){ PORT2,PIN13, (PFS_PSEL_GPT | R_PFS_PMR)}
#define GPIO_GTIOC0A_3                      (gpio_pinset_t){ PORT4,PIN15, (PFS_PSEL_GPT | R_PFS_PMR)}
#define GPIO_GTIOC0A_4                      (gpio_pinset_t){ PORT5,PIN12, (PFS_PSEL_GPT | R_PFS_PMR)}

#define GPIO_GTIOC0B_1                      (gpio_pinset_t){ PORT2,PIN10, (PFS_PSEL_GPT | R_PFS_PMR)}
#define GPIO_GTIOC0B_2                      (gpio_pinset_t){ PORT2,PIN12, (PFS_PSEL_GPT | R_PFS_PMR)}
#define GPIO_GTIOC0B_3                      (gpio_pinset_t){ PORT4,PIN14, (PFS_PSEL_GPT | R_PFS_PMR)}
#define GPIO_GTIOC0B_4                      (gpio_pinset_t){ PORT5,PIN11, (PFS_PSEL_GPT | R_PFS_PMR)}

#define GPIO_GTIOC1A_1                      (gpio_pinset_t){ PORT1,PIN5, (PFS_PSEL_GPT | R_PFS_PMR)}
#define GPIO_GTIOC1A_2                      (gpio_pinset_t){ PORT2,PIN9, (PFS_PSEL_GPT | R_PFS_PMR)}
#define GPIO_GTIOC1A_3                      (gpio_pinset_t){ PORT4,PIN5, (PFS_PSEL_GPT | R_PFS_PMR)}

#define GPIO_GTIOC1B_1                      (gpio_pinset_t){ PORT1,PIN4, (PFS_PSEL_GPT | R_PFS_PMR)}
#define GPIO_GTIOC1B_2                      (gpio_pinset_t){ PORT2,PIN8, (PFS_PSEL_GPT | R_PFS_PMR)}
#define GPIO_GTIOC1B_3                      (gpio_pinset_t){ PORT4,PIN6, (PFS_PSEL_GPT | R_PFS_PMR)}

#define GPIO_GTIOC2A_1                      (gpio_pinset_t){ PORT1, PIN3, (PFS_PSEL_GPT | R_PFS_PMR)}
#define GPIO_GTIOC2A_2                      (gpio_pinset_t){ PORT7, PIN13, (PFS_PSEL_GPT | R_PFS_PMR)}
#define GPIO_GTIOC2A_3                      (gpio_pinset_t){ PORT1, PIN13, (PFS_PSEL_GPT | R_PFS_PMR)}

#define GPIO_GTIOC2B_1                      (gpio_pinset_t){ PORT1, PIN2, (PFS_PSEL_GPT | R_PFS_PMR)}
#define GPIO_GTIOC2B_2                      (gpio_pinset_t){ PORT7, PIN12, (PFS_PSEL_GPT | R_PFS_PMR)}
#define GPIO_GTIOC2B_3                      (gpio_pinset_t){ PORT1, PIN14, (PFS_PSEL_GPT | R_PFS_PMR)}

#define GPIO_GTIOC3A_1                      (gpio_pinset_t){ PORT3,PIN0, (PFS_PSEL_GPT | R_PFS_PMR)}
#define GPIO_GTIOC3A_2                      (gpio_pinset_t){ PORT4,PIN3, (PFS_PSEL_GPT | R_PFS_PMR)}

#define GPIO_GTIOC3B_1                      (gpio_pinset_t){ PORT4,PIN4, (PFS_PSEL_GPT | R_PFS_PMR)}
#define GPIO_GTIOC3B_2                      (gpio_pinset_t){ PORT1,PIN12, (PFS_PSEL_GPT | R_PFS_PMR)}

#define GPIO_GTIOC4A_1                      (gpio_pinset_t){ PORT3,PIN2, (PFS_PSEL_GPT | R_PFS_PMR)}
#define GPIO_GTIOC4A_2                      (gpio_pinset_t){ PORT6,PIN10, (PFS_PSEL_GPT | R_PFS_PMR)}

#define GPIO_GTIOC4B_1                      (gpio_pinset_t){ PORT2,PIN4, (PFS_PSEL_GPT | R_PFS_PMR)}
#define GPIO_GTIOC4B_2                      (gpio_pinset_t){ PORT3,PIN1, (PFS_PSEL_GPT | R_PFS_PMR)}
#define GPIO_GTIOC4B_3                      (gpio_pinset_t){ PORT6,PIN11, (PFS_PSEL_GPT | R_PFS_PMR)}

#define GPIO_GTIOC5A_1                      (gpio_pinset_t){ PORT2,PIN3, (PFS_PSEL_GPT | R_PFS_PMR)}
#define GPIO_GTIOC5A_2                      (gpio_pinset_t){ PORT7,PIN0, (PFS_PSEL_GPT | R_PFS_PMR)}
#define GPIO_GTIOC5A_3                      (gpio_pinset_t){ PORT1,PIN15, (PFS_PSEL_GPT | R_PFS_PMR)}

#define GPIO_GTIOC5B_1                      (gpio_pinset_t){ PORT2,PIN2, (PFS_PSEL_GPT | R_PFS_PMR)}
#define GPIO_GTIOC5B_2                      (gpio_pinset_t){ PORT6,PIN9, (PFS_PSEL_GPT | R_PFS_PMR)}
#define GPIO_GTIOC5B_3                      (gpio_pinset_t){ PORT7,PIN1, (PFS_PSEL_GPT | R_PFS_PMR)}

#define GPIO_GTIOC10A_1                     (gpio_pinset_t){ PORT4, PIN8, (PFS_PSEL_GPT | R_PFS_PMR)}

#define GPIO_GTIOC10B_1                     (gpio_pinset_t){ PORT4, PIN7, (PFS_PSEL_GPT | R_PFS_PMR)}

#define GPIO_GTIOC11A_1                     (gpio_pinset_t){ PORT8,PIN0, (PFS_PSEL_GPT | R_PFS_PMR)}

#define GPIO_GTIOC11B_1                     (gpio_pinset_t){ PORT8,PIN1, (PFS_PSEL_GPT | R_PFS_PMR)}

#define GPIO_GTIOC12A_1                     (gpio_pinset_t){ PORT8,PIN2, (PFS_PSEL_GPT | R_PFS_PMR)}

#define GPIO_GTIOC12B_1                     (gpio_pinset_t){ PORT8,PIN3, (PFS_PSEL_GPT | R_PFS_PMR)}

#define GPIO_GTIOC13A_1                     (gpio_pinset_t){ PORT8,PIN4, (PFS_PSEL_GPT | R_PFS_PMR)}

#define GPIO_GTIOC13B_1                     (gpio_pinset_t){ PORT8,PIN8, (PFS_PSEL_GPT | R_PFS_PMR)}

/* CAN Alternative Functions */
#define GPIO_CRX0_1                         (gpio_pinset_t){ PORT1,PIN2, (PFS_PSEL_CAN | R_PFS_PMR)}
#define GPIO_CTX0_1                         (gpio_pinset_t){ PORT1,PIN3, (PFS_PSEL_CAN | R_PFS_PMR)}
#define GPIO_CRX0_2                         (gpio_pinset_t){ PORT2,PIN2, (PFS_PSEL_CAN | R_PFS_PMR)}
#define GPIO_CTX0_2                         (gpio_pinset_t){ PORT2,PIN3, (PFS_PSEL_CAN | R_PFS_PMR)}
#define GPIO_CRX0_3                         (gpio_pinset_t){ PORT3,PIN11, (PFS_PSEL_CAN | R_PFS_PMR)}
#define GPIO_CTX0_3                         (gpio_pinset_t){ PORT3,PIN12, (PFS_PSEL_CAN | R_PFS_PMR)}
#define GPIO_CRX0_4                         (gpio_pinset_t){ PORT4,PIN2, (PFS_PSEL_CAN | R_PFS_PMR)}
#define GPIO_CTX0_4                         (gpio_pinset_t){ PORT4,PIN1, (PFS_PSEL_CAN | R_PFS_PMR)}
#define GPIO_CRX0_5                         (gpio_pinset_t){ PORT7,PIN5, (PFS_PSEL_CAN | R_PFS_PMR)}
#define GPIO_CTX0_5                         (gpio_pinset_t){ PORT7,PIN4, (PFS_PSEL_CAN | R_PFS_PMR)}
#define GPIO_CRX1_1                         (gpio_pinset_t){ PORT2,PIN8, (PFS_PSEL_CAN | R_PFS_PMR)}
#define GPIO_CTX1_1                         (gpio_pinset_t){ PORT2,PIN9, (PFS_PSEL_CAN | R_PFS_PMR)}
#define GPIO_CRX1_2                         (gpio_pinset_t){ PORT4,PIN14, (PFS_PSEL_CAN | R_PFS_PMR)}
#define GPIO_CTX1_2                         (gpio_pinset_t){ PORT4,PIN15, (PFS_PSEL_CAN | R_PFS_PMR)}
#define GPIO_CRX1_3                         (gpio_pinset_t){ PORT5,PIN11, (PFS_PSEL_CAN | R_PFS_PMR)}
#define GPIO_CTX1_3                         (gpio_pinset_t){ PORT5,PIN12, (PFS_PSEL_CAN | R_PFS_PMR)}
#define GPIO_CRX1_4                         (gpio_pinset_t){ PORT6,PIN10, (PFS_PSEL_CAN | R_PFS_PMR)}
#define GPIO_CTX1_4                         (gpio_pinset_t){ PORT6,PIN9, (PFS_PSEL_CAN | R_PFS_PMR)}

/* USB Alternative Functions */
#define GPIO_USB_VBUS                       (gpio_pinset_t){ PORT4,PIN7, (PFS_PSEL_USBFS | R_PFS_PMR)}
#define GPIO_USB_VBUSEN                     (gpio_pinset_t){ PORT2,PIN6, (PFS_PSEL_USBFS | R_PFS_PMR)}
#define GPIO_USB_OVRCURA                    (gpio_pinset_t){ PORT2,PIN5, (PFS_PSEL_USBFS | R_PFS_PMR)}
#define GPIO_USB_OVRCURB                    (gpio_pinset_t){ PORT2,PIN4, (PFS_PSEL_USBFS | R_PFS_PMR)}
#define GPIO_USB_ID                         (gpio_pinset_t){ PORT4,PIN11, (PFS_PSEL_USBFS | R_PFS_PMR)}
#define GPIO_USB_EXICEN                     (gpio_pinset_t){ PORT4,PIN12, (PFS_PSEL_USBFS | R_PFS_PMR)}
#define GPIO_USB_DP                         (gpio_pinset_t){ PORT8,PIN14, (PFS_PSEL_USBFS | R_PFS_PMR)}
#define GPIO_USB_DM                         (gpio_pinset_t){ PORT8,PIN15, (PFS_PSEL_USBFS | R_PFS_PMR)}

/* Ethernet Alternative Functions */
#define GPIO_ET0_CRS_A                      (gpio_pinset_t){ PORT1,PIN12, (PFS_PSEL_ETHERNET | R_PFS_PMR)}
#define GPIO_ET0_CRS_B                      (gpio_pinset_t){ PORT7,PIN5, (PFS_PSEL_ETHERNET | R_PFS_PMR)}
#define GPIO_ET0_EXOUT                      (gpio_pinset_t){ PORT1,PIN13, (PFS_PSEL_ETHERNET | R_PFS_PMR)}
#define GPIO_ET0_LINKSTA                    (gpio_pinset_t){ PORT1,PIN14, (PFS_PSEL_ETHERNET | R_PFS_PMR)}
#define GPIO_ET0_WOL_1                      (gpio_pinset_t){ PORT1,PIN15, (PFS_PSEL_ETHERNET | R_PFS_PMR)}
#define GPIO_ET0_WOL_2                      (gpio_pinset_t){ PORT4,PIN0, (PFS_PSEL_ETHERNET | R_PFS_PMR)}
#define GPIO_ET0_RX_CLK_A                   (gpio_pinset_t){ PORT3,PIN0, (PFS_PSEL_ETHERNET | R_PFS_PMR)}
#define GPIO_ET0_RX_CLK_B                   (gpio_pinset_t){ PORT7,PIN4, (PFS_PSEL_ETHERNET | R_PFS_PMR)}
#define GPIO_ET0_ERXD0_A                    (gpio_pinset_t){ PORT3,PIN1, (PFS_PSEL_ETHERNET | R_PFS_PMR)}
#define GPIO_ET0_ERXD0_B                    (gpio_pinset_t){ PORT7,PIN3, (PFS_PSEL_ETHERNET | R_PFS_PMR)}
#define GPIO_ET0_ERXD1_A                    (gpio_pinset_t){ PORT3,PIN2, (PFS_PSEL_ETHERNET | R_PFS_PMR)}
#define GPIO_ET0_ERXD1_B                    (gpio_pinset_t){ PORT7,PIN2, (PFS_PSEL_ETHERNET | R_PFS_PMR)}
#define GPIO_ET0_ETXD0_A                    (gpio_pinset_t){ PORT3,PIN3, (PFS_PSEL_ETHERNET | R_PFS_PMR)}
#define GPIO_ET0_ETXD0_B                    (gpio_pinset_t){ PORT7,PIN1, (PFS_PSEL_ETHERNET | R_PFS_PMR)}
#define GPIO_ET0_ETXD1_A                    (gpio_pinset_t){ PORT3,PIN4, (PFS_PSEL_ETHERNET | R_PFS_PMR)}
#define GPIO_ET0_ETXD1_B                    (gpio_pinset_t){ PORT7,PIN0, (PFS_PSEL_ETHERNET | R_PFS_PMR)}
#define GPIO_ET0_RX_ER_A                    (gpio_pinset_t){ PORT3,PIN5, (PFS_PSEL_ETHERNET | R_PFS_PMR)}
#define GPIO_ET0_RX_ER_B                    (gpio_pinset_t){ PORT4,PIN6, (PFS_PSEL_ETHERNET | R_PFS_PMR)}
#define GPIO_ET0_TX_EN_A                    (gpio_pinset_t){ PORT3,PIN6, (PFS_PSEL_ETHERNET | R_PFS_PMR)}
#define GPIO_ET0_TX_EN_B                    (gpio_pinset_t){ PORT4,PIN5, (PFS_PSEL_ETHERNET | R_PFS_PMR)}
#define GPIO_ET0_MDIO_1                     (gpio_pinset_t){ PORT3,PIN7, (PFS_PSEL_ETHERNET | R_PFS_PMR)}
#define GPIO_ET0_MDIO_2                     (gpio_pinset_t){ PORT4,PIN2, (PFS_PSEL_ETHERNET | R_PFS_PMR)}
#define GPIO_ET0_MDC_1                      (gpio_pinset_t){ PORT3,PIN8, (PFS_PSEL_ETHERNET | R_PFS_PMR)}
#define GPIO_ET0_MDC_2                      (gpio_pinset_t){ PORT4,PIN1, (PFS_PSEL_ETHERNET | R_PFS_PMR)}
#define GPIO_ET0_ETXD3                      (gpio_pinset_t){ PORT3,PIN9, (PFS_PSEL_ETHERNET | R_PFS_PMR)}
#define GPIO_ET0_ETXD2                      (gpio_pinset_t){ PORT3,PIN10, (PFS_PSEL_ETHERNET | R_PFS_PMR)}
#define GPIO_ET0_TX_ER                      (gpio_pinset_t){ PORT3,PIN11, (PFS_PSEL_ETHERNET | R_PFS_PMR)}
#define GPIO_ET0_TX_CLK                     (gpio_pinset_t){ PORT3,PIN12, (PFS_PSEL_ETHERNET | R_PFS_PMR)}
#define GPIO_ET0_ERXD2                      (gpio_pinset_t){ PORT6,PIN11, (PFS_PSEL_ETHERNET | R_PFS_PMR)}
#define GPIO_ET0_ERXD3                      (gpio_pinset_t){ PORT6,PIN12, (PFS_PSEL_ETHERNET | R_PFS_PMR)}
#define GPIO_ET0_COL                        (gpio_pinset_t){ PORT6,PIN10, (PFS_PSEL_ETHERNET | R_PFS_PMR)}
#define GPIO_ET0_RX_DV                      (gpio_pinset_t){ PORT6,PIN9, (PFS_PSEL_ETHERNET | R_PFS_PMR)}

