nguyentri/nuttx/arch/arm/src/ra8/hardware/ra8e1/ra8e1_pinmap.h
/* RMII Alternative Functions */
#define GPIO_RMII0_CRS_DV_A                 (gpio_pinset_t){ PORT1,PIN12, (PFS_PSEL_ETHERNET | R_PFS_PMR)}
#define GPIO_RMII0_CRS_DV_B                 (gpio_pinset_t){ PORT7,PIN5, (PFS_PSEL_ETHERNET | R_PFS_PMR)}
#define GPIO_RMII0_RX_ER_A                  (gpio_pinset_t){ PORT3,PIN0, (PFS_PSEL_ETHERNET | R_PFS_PMR)}
#define GPIO_RMII0_RX_ER_B                  (gpio_pinset_t){ PORT7,PIN4, (PFS_PSEL_ETHERNET | R_PFS_PMR)}
#define GPIO_RMII0_RXD1_A                   (gpio_pinset_t){ PORT3,PIN1, (PFS_PSEL_ETHERNET | R_PFS_PMR)}
#define GPIO_RMII0_RXD1_B                   (gpio_pinset_t){ PORT7,PIN3, (PFS_PSEL_ETHERNET | R_PFS_PMR)}
#define GPIO_RMII0_RXD0_A                   (gpio_pinset_t){ PORT3,PIN2, (PFS_PSEL_ETHERNET | R_PFS_PMR)}
#define GPIO_RMII0_RXD0_B                   (gpio_pinset_t){ PORT7,PIN2, (PFS_PSEL_ETHERNET | R_PFS_PMR)}
#define GPIO_RMII0_TXD0_A                   (gpio_pinset_t){ PORT3,PIN4, (PFS_PSEL_ETHERNET | R_PFS_PMR)}
#define GPIO_RMII0_TXD0_B                   (gpio_pinset_t){ PORT7,PIN0, (PFS_PSEL_ETHERNET | R_PFS_PMR)}
#define GPIO_RMII0_TXD1_A                   (gpio_pinset_t){ PORT3,PIN5, (PFS_PSEL_ETHERNET | R_PFS_PMR)}
#define GPIO_RMII0_TXD1_B                   (gpio_pinset_t){ PORT4,PIN6, (PFS_PSEL_ETHERNET | R_PFS_PMR)}
#define GPIO_RMII0_TXD_EN_A                 (gpio_pinset_t){ PORT3,PIN6, (PFS_PSEL_ETHERNET | R_PFS_PMR)}
#define GPIO_RMII0_TXD_EN_B                 (gpio_pinset_t){ PORT4,PIN5, (PFS_PSEL_ETHERNET | R_PFS_PMR)}
#define GPIO_REF50CK0_A                     (gpio_pinset_t){ PORT3,PIN3, (PFS_PSEL_ETHERNET | R_PFS_PMR)}
#define GPIO_REF50CK0_B                     (gpio_pinset_t){ PORT7,PIN1, (PFS_PSEL_ETHERNET | R_PFS_PMR)}

/* Audio Clock Alternative Functions */
#define GPIO_AUDIO_CLK_1                    (gpio_pinset_t){ PORT4,PIN0, (PFS_PSEL_CLKOUT_ACMPLP_RTC | R_PFS_PMR)}
#define GPIO_AUDIO_CLK_2                    (gpio_pinset_t){ PORT4,PIN2, (PFS_PSEL_CLKOUT_ACMPLP_RTC | R_PFS_PMR)}
#define GPIO_AUDIO_CLK_3                    (gpio_pinset_t){ PORT7,PIN8, (PFS_PSEL_CLKOUT_ACMPLP_RTC | R_PFS_PMR)}

/* SSI (Synchronous Serial Interface) Alternative Functions */
#define GPIO_SSIBCK0_A                      (gpio_pinset_t){ PORT4,PIN3, (PFS_PSEL_SSIE | R_PFS_PMR)}
#define GPIO_SSIBCK0_B                      (gpio_pinset_t){ PORT1,PIN12, (PFS_PSEL_SSIE | R_PFS_PMR)}
#define GPIO_SSILRCK0_A                     (gpio_pinset_t){ PORT4,PIN4, (PFS_PSEL_SSIE | R_PFS_PMR)}
#define GPIO_SSILRCK0_B                     (gpio_pinset_t){ PORT1,PIN13, (PFS_PSEL_SSIE | R_PFS_PMR)}
#define GPIO_SSITXD0_A                      (gpio_pinset_t){ PORT4,PIN5, (PFS_PSEL_SSIE | R_PFS_PMR)}
#define GPIO_SSITXD0_B                      (gpio_pinset_t){ PORT1,PIN15, (PFS_PSEL_SSIE | R_PFS_PMR)}
#define GPIO_SSIRXD0_A                      (gpio_pinset_t){ PORT4,PIN6, (PFS_PSEL_SSIE | R_PFS_PMR)}
#define GPIO_SSIRXD0_B                      (gpio_pinset_t){ PORT1,PIN14, (PFS_PSEL_SSIE | R_PFS_PMR)}
#define GPIO_SSIBCK1_A                      (gpio_pinset_t){ PORT2,PIN4, (PFS_PSEL_SSIE | R_PFS_PMR)}
#define GPIO_SSIBCK1_B                      (gpio_pinset_t){ PORT7,PIN2, (PFS_PSEL_SSIE | R_PFS_PMR)}
#define GPIO_SSILRCK1_A                     (gpio_pinset_t){ PORT2,PIN5, (PFS_PSEL_SSIE | R_PFS_PMR)}
#define GPIO_SSILRCK1_B                     (gpio_pinset_t){ PORT7,PIN1, (PFS_PSEL_SSIE | R_PFS_PMR)}
#define GPIO_SSIDATA1_A                     (gpio_pinset_t){ PORT2,PIN6, (PFS_PSEL_SSIE | R_PFS_PMR)}
#define GPIO_SSIDATA1_B                     (gpio_pinset_t){ PORT7,PIN0, (PFS_PSEL_SSIE | R_PFS_PMR)}

/* DAC Alternative Functions */
#define GPIO_DA0                            (gpio_pinset_t){ PORT0,PIN14, (PFS_PSEL_DAC | R_PFS_PMR)}

/* RTC Alternative Functions */
#define GPIO_RTCOUT_1                       (gpio_pinset_t){ PORT4,PIN7, (PFS_PSEL_CLKOUT_ACMPLP_RTC | R_PFS_PMR)}
#define GPIO_RTCOUT_2                       (gpio_pinset_t){ PORT6,PIN1, (PFS_PSEL_CLKOUT_ACMPLP_RTC | R_PFS_PMR)}
#define GPIO_RTCIC0                         (gpio_pinset_t){ PORT4,PIN2, (PFS_PSEL_CLKOUT_ACMPLP_RTC | R_PFS_PMR)}
#define GPIO_RTCIC1                         (gpio_pinset_t){ PORT4,PIN3, (PFS_PSEL_CLKOUT_ACMPLP_RTC | R_PFS_PMR)}
#define GPIO_RTCIC2                         (gpio_pinset_t){ PORT4,PIN4, (PFS_PSEL_CLKOUT_ACMPLP_RTC | R_PFS_PMR)}

/* Comparator Alternative Functions */
#define GPIO_IVCMP0                         (gpio_pinset_t){ PORT0,PIN10, (PFS_PSEL_OPAMP | R_PFS_PMR)}
#define GPIO_IVCMP2_1                       (gpio_pinset_t){ PORT0,PIN0, (PFS_PSEL_OPAMP | R_PFS_PMR)}
#define GPIO_IVCMP2_2                       (gpio_pinset_t){ PORT0,PIN4, (PFS_PSEL_OPAMP | R_PFS_PMR)}
#define GPIO_IVCMP3_1                       (gpio_pinset_t){ PORT0,PIN2, (PFS_PSEL_OPAMP | R_PFS_PMR)}
#define GPIO_IVCMP3_2                       (gpio_pinset_t){ PORT0,PIN6, (PFS_PSEL_OPAMP | R_PFS_PMR)}
#define GPIO_IVREF0                         (gpio_pinset_t){ PORT0,PIN1, (PFS_PSEL_OPAMP | R_PFS_PMR)}
#define GPIO_IVREF1                         (gpio_pinset_t){ PORT0,PIN3, (PFS_PSEL_OPAMP | R_PFS_PMR)}
#define GPIO_VCOUT_1                        (gpio_pinset_t){ PORT2,PIN8, (PFS_PSEL_OPAMP | R_PFS_PMR)}
#define GPIO_VCOUT_2                        (gpio_pinset_t){ PORT7,PIN3, (PFS_PSEL_OPAMP | R_PFS_PMR)}

/* AGT (Asynchronous General Purpose Timer) Alternative Functions */
#define GPIO_AGTIO0_1                       (gpio_pinset_t){ PORT1,PIN0, (PFS_PSEL_AGT | R_PFS_PMR)}
#define GPIO_AGTIO0_2                       (gpio_pinset_t){ PORT3,PIN1, (PFS_PSEL_AGT | R_PFS_PMR)}
#define GPIO_AGTIO0_3                       (gpio_pinset_t){ PORT4,PIN7, (PFS_PSEL_AGT | R_PFS_PMR)}
#define GPIO_AGTIO0_4                       (gpio_pinset_t){ PORT7,PIN5, (PFS_PSEL_AGT | R_PFS_PMR)}
#define GPIO_AGTIO1_1                       (gpio_pinset_t){ PORT2,PIN4, (PFS_PSEL_AGT | R_PFS_PMR)}
#define GPIO_AGTIO1_2                       (gpio_pinset_t){ PORT4,PIN0, (PFS_PSEL_AGT | R_PFS_PMR)}
#define GPIO_AGTIO1_3                       (gpio_pinset_t){ PORT4,PIN5, (PFS_PSEL_AGT | R_PFS_PMR)}
#define GPIO_AGTO0_1                        (gpio_pinset_t){ PORT1,PIN2, (PFS_PSEL_AGT | R_PFS_PMR)}
#define GPIO_AGTO0_2                        (gpio_pinset_t){ PORT6,PIN14, (PFS_PSEL_AGT | R_PFS_PMR)}
#define GPIO_AGTO0_3                        (gpio_pinset_t){ PORT7,PIN4, (PFS_PSEL_AGT | R_PFS_PMR)}
#define GPIO_AGTO1_1                        (gpio_pinset_t){ PORT2,PIN5, (PFS_PSEL_AGT | R_PFS_PMR)}
#define GPIO_AGTO1_2                        (gpio_pinset_t){ PORT6,PIN13, (PFS_PSEL_AGT | R_PFS_PMR)}
#define GPIO_AGTO1_3                        (gpio_pinset_t){ PORT7,PIN3, (PFS_PSEL_AGT | R_PFS_PMR)}
#define GPIO_AGTEE0_1                       (gpio_pinset_t){ PORT1,PIN1, (PFS_PSEL_AGT | R_PFS_PMR)}
#define GPIO_AGTEE0_2                       (gpio_pinset_t){ PORT7,PIN11, (PFS_PSEL_AGT | R_PFS_PMR)}
#define GPIO_AGTEE1_1                       (gpio_pinset_t){ PORT2,PIN12, (PFS_PSEL_AGT | R_PFS_PMR)}
#define GPIO_AGTEE1_2                       (gpio_pinset_t){ PORT3,PIN10, (PFS_PSEL_AGT | R_PFS_PMR)}
#define GPIO_AGTEE1_3                       (gpio_pinset_t){ PORT4,PIN12, (PFS_PSEL_AGT | R_PFS_PMR)}
#define GPIO_AGTOA0_1                       (gpio_pinset_t){ PORT1,PIN7, (PFS_PSEL_AGT | R_PFS_PMR)}
#define GPIO_AGTOA0_2                       (gpio_pinset_t){ PORT7,PIN13, (PFS_PSEL_AGT | R_PFS_PMR)}
#define GPIO_AGTOA0_3                       (gpio_pinset_t){ PORT8,PIN0, (PFS_PSEL_AGT | R_PFS_PMR)}
#define GPIO_AGTOA1_1                       (gpio_pinset_t){ PORT3,PIN12, (PFS_PSEL_AGT | R_PFS_PMR)}
#define GPIO_AGTOA1_2                       (gpio_pinset_t){ PORT4,PIN11, (PFS_PSEL_AGT | R_PFS_PMR)}
#define GPIO_AGTOB0_1                       (gpio_pinset_t){ PORT1,PIN6, (PFS_PSEL_AGT | R_PFS_PMR)}
#define GPIO_AGTOB0_2                       (gpio_pinset_t){ PORT7,PIN12, (PFS_PSEL_AGT | R_PFS_PMR)}
#define GPIO_AGTOB0_3                       (gpio_pinset_t){ PORT8,PIN1, (PFS_PSEL_AGT | R_PFS_PMR)}
#define GPIO_AGTOB1_1                       (gpio_pinset_t){ PORT3,PIN8, (PFS_PSEL_AGT | R_PFS_PMR)}
#define GPIO_AGTOB1_2                       (gpio_pinset_t){ PORT3,PIN11, (PFS_PSEL_AGT | R_PFS_PMR)}
#define GPIO_AGTOB1_3                       (gpio_pinset_t){ PORT4,PIN10, (PFS_PSEL_AGT | R_PFS_PMR)}

/* GPT Trigger Functions */
#define GPIO_GTETRGA_1                      (gpio_pinset_t){ PORT1,PIN0, (PFS_PSEL_GPT | R_PFS_PMR)}
#define GPIO_GTETRGA_2                      (gpio_pinset_t){ PORT4,PIN1, (PFS_PSEL_GPT | R_PFS_PMR)}
#define GPIO_GTETRGA_3                      (gpio_pinset_t){ PORT6,PIN13, (PFS_PSEL_GPT | R_PFS_PMR)}
#define GPIO_GTETRGB_1                      (gpio_pinset_t){ PORT1,PIN1, (PFS_PSEL_GPT | R_PFS_PMR)}
#define GPIO_GTETRGB_2                      (gpio_pinset_t){ PORT1,PIN4, (PFS_PSEL_GPT | R_PFS_PMR)}
#define GPIO_GTETRGB_3                      (gpio_pinset_t){ PORT6,PIN14, (PFS_PSEL_GPT | R_PFS_PMR)}
#define GPIO_GTETRGC_1                      (gpio_pinset_t){ PORT2,PIN13, (PFS_PSEL_GPT | R_PFS_PMR)}
#define GPIO_GTETRGC_2                      (gpio_pinset_t){ PORT8,PIN3, (PFS_PSEL_GPT | R_PFS_PMR)}
#define GPIO_GTETRGD_1                      (gpio_pinset_t){ PORT2,PIN12, (PFS_PSEL_GPT | R_PFS_PMR)}
#define GPIO_GTETRGD_2                      (gpio_pinset_t){ PORT8,PIN4, (PFS_PSEL_GPT | R_PFS_PMR)}

