nguyentri/nuttx/arch/arm/src/ra8/hardware/ra8e1/ra8e1_pinmap.h
/* ADC Trigger Functions */
#define GPIO_ADTRG0_1                       (gpio_pinset_t){ PORT1,PIN2, (PFS_PSEL_CAC_ADC14 | R_PFS_PMR)}
#define GPIO_ADTRG0_2                       (gpio_pinset_t){ PORT4,PIN7, (PFS_PSEL_CAC_ADC14 | R_PFS_PMR)}
#define GPIO_ADTRG1_1                       (gpio_pinset_t){ PORT2,PIN13, (PFS_PSEL_CAC_ADC14 | R_PFS_PMR)}
#define GPIO_ADTRG1_2                       (gpio_pinset_t){ PORT4,PIN0, (PFS_PSEL_CAC_ADC14 | R_PFS_PMR)}

/* ULPT (Ultra-Low-Power Timer) Alternative Functions */
#define GPIO_ULPTOA0_1                      (gpio_pinset_t){ PORT1,PIN13, (PFS_PSEL_ULPT | R_PFS_PMR)}
#define GPIO_ULPTOA0_2                      (gpio_pinset_t){ PORT4,PIN9, (PFS_PSEL_ULPT | R_PFS_PMR)}
#define GPIO_ULPTOA1_1                      (gpio_pinset_t){ PORT2,PIN3, (PFS_PSEL_ULPT | R_PFS_PMR)}
#define GPIO_ULPTOA1_2                      (gpio_pinset_t){ PORT3,PIN7, (PFS_PSEL_ULPT | R_PFS_PMR)}
#define GPIO_ULPTOA1_3                      (gpio_pinset_t){ PORT6,PIN9, (PFS_PSEL_ULPT | R_PFS_PMR)}
#define GPIO_ULPTOB0_1                      (gpio_pinset_t){ PORT1,PIN12, (PFS_PSEL_ULPT | R_PFS_PMR)}
#define GPIO_ULPTOB0_2                      (gpio_pinset_t){ PORT4,PIN8, (PFS_PSEL_ULPT | R_PFS_PMR)}
#define GPIO_ULPTOB1_1                      (gpio_pinset_t){ PORT2,PIN2, (PFS_PSEL_ULPT | R_PFS_PMR)}
#define GPIO_ULPTOB1_2                      (gpio_pinset_t){ PORT3,PIN8, (PFS_PSEL_ULPT | R_PFS_PMR)}
#define GPIO_ULPTOB1_3                      (gpio_pinset_t){ PORT6,PIN10, (PFS_PSEL_ULPT | R_PFS_PMR)}
#define GPIO_ULPTO0_1                       (gpio_pinset_t){ PORT3,PIN2, (PFS_PSEL_ULPT | R_PFS_PMR)}
#define GPIO_ULPTO0_2                       (gpio_pinset_t){ PORT6,PIN3, (PFS_PSEL_ULPT | R_PFS_PMR)}
#define GPIO_ULPTO0_3                       (gpio_pinset_t){ PORT7,PIN2, (PFS_PSEL_ULPT | R_PFS_PMR)}
#define GPIO_ULPTO1_1                       (gpio_pinset_t){ PORT1,PIN5, (PFS_PSEL_ULPT | R_PFS_PMR)}
#define GPIO_ULPTO1_2                       (gpio_pinset_t){ PORT3,PIN4, (PFS_PSEL_ULPT | R_PFS_PMR)}
#define GPIO_ULPTO1_3                       (gpio_pinset_t){ PORT7,PIN1, (PFS_PSEL_ULPT | R_PFS_PMR)}
#define GPIO_ULPTEE0_1                      (gpio_pinset_t){ PORT2,PIN13, (PFS_PSEL_ULPT | R_PFS_PMR)}
#define GPIO_ULPTEE0_2                      (gpio_pinset_t){ PORT3,PIN0, (PFS_PSEL_ULPT | R_PFS_PMR)}
#define GPIO_ULPTEE0_3                      (gpio_pinset_t){ PORT6,PIN2, (PFS_PSEL_ULPT | R_PFS_PMR)}
#define GPIO_ULPTEE1_1                      (gpio_pinset_t){ PORT1,PIN6, (PFS_PSEL_ULPT | R_PFS_PMR)}
#define GPIO_ULPTEE1_2                      (gpio_pinset_t){ PORT3,PIN5, (PFS_PSEL_ULPT | R_PFS_PMR)}
#define GPIO_ULPTEE1_3                      (gpio_pinset_t){ PORT4,PIN13, (PFS_PSEL_ULPT | R_PFS_PMR)}
#define GPIO_ULPTEVI0_1                     (gpio_pinset_t){ PORT3,PIN0, (PFS_PSEL_ULPT | R_PFS_PMR)}
#define GPIO_ULPTEVI0_2                     (gpio_pinset_t){ PORT6,PIN1, (PFS_PSEL_ULPT | R_PFS_PMR)}
#define GPIO_ULPTEVI1_1                     (gpio_pinset_t){ PORT3,PIN6, (PFS_PSEL_ULPT | R_PFS_PMR)}
#define GPIO_ULPTEVI1_2                     (gpio_pinset_t){ PORT6,PIN0, (PFS_PSEL_ULPT | R_PFS_PMR)}

/* OctaRAM/OSPI Memory Interface Functions */
#define GPIO_OM_CS0                         (gpio_pinset_t){ PORT1,PIN7, (PFS_PSEL_XSPI | R_PFS_PMR)}
#define GPIO_OM_CS1                         (gpio_pinset_t){ PORT1,PIN4, (PFS_PSEL_XSPI | R_PFS_PMR)}
#define GPIO_OM_RESET                       (gpio_pinset_t){ PORT1,PIN6, (PFS_PSEL_XSPI | R_PFS_PMR)}
#define GPIO_OM_SIO0                        (gpio_pinset_t){ PORT1,PIN0, (PFS_PSEL_XSPI | R_PFS_PMR)}
#define GPIO_OM_SIO1                        (gpio_pinset_t){ PORT8,PIN3, (PFS_PSEL_XSPI | R_PFS_PMR)}
#define GPIO_OM_SIO2                        (gpio_pinset_t){ PORT1,PIN3, (PFS_PSEL_XSPI | R_PFS_PMR)}
#define GPIO_OM_SIO3                        (gpio_pinset_t){ PORT1,PIN1, (PFS_PSEL_XSPI | R_PFS_PMR)}
#define GPIO_OM_SIO4                        (gpio_pinset_t){ PORT1,PIN2, (PFS_PSEL_XSPI | R_PFS_PMR)}
#define GPIO_OM_SIO5                        (gpio_pinset_t){ PORT8,PIN0, (PFS_PSEL_XSPI | R_PFS_PMR)}
#define GPIO_OM_SIO6                        (gpio_pinset_t){ PORT8,PIN2, (PFS_PSEL_XSPI | R_PFS_PMR)}
#define GPIO_OM_SIO7                        (gpio_pinset_t){ PORT8,PIN4, (PFS_PSEL_XSPI | R_PFS_PMR)}
#define GPIO_OM_SCLK                        (gpio_pinset_t){ PORT8,PIN8, (PFS_PSEL_XSPI | R_PFS_PMR)}
#define GPIO_OM_SCLKN                       (gpio_pinset_t){ PORT8,PIN9, (PFS_PSEL_XSPI | R_PFS_PMR)}
#define GPIO_OM_DQS                         (gpio_pinset_t){ PORT8,PIN1, (PFS_PSEL_XSPI | R_PFS_PMR)}
#define GPIO_OM_WP1                         (gpio_pinset_t){ PORT6,PIN1, (PFS_PSEL_XSPI | R_PFS_PMR)}
#define GPIO_OM_RSTO1                       (gpio_pinset_t){ PORT6,PIN0, (PFS_PSEL_XSPI | R_PFS_PMR)}
#define GPIO_OM_ECSINT1                     (gpio_pinset_t){ PORT1,PIN5, (PFS_PSEL_XSPI | R_PFS_PMR)}

/* VIO (Video Input/Output) Alternative Functions */
#define GPIO_VIO_CLK                        (gpio_pinset_t){ PORT7,PIN8, (PFS_PSEL_CEU | R_PFS_PMR)}
#define GPIO_VIO_HD                         (gpio_pinset_t){ PORT7,PIN9, (PFS_PSEL_CEU | R_PFS_PMR)}
#define GPIO_VIO_VD                         (gpio_pinset_t){ PORT7,PIN10, (PFS_PSEL_CEU | R_PFS_PMR)}
#define GPIO_VIO_FLD                        (gpio_pinset_t){ PORT5,PIN13, (PFS_PSEL_CEU | R_PFS_PMR)}
#define GPIO_VIO_D0                         (gpio_pinset_t){ PORT4,PIN0, (PFS_PSEL_CEU | R_PFS_PMR)}
#define GPIO_VIO_D1                         (gpio_pinset_t){ PORT4,PIN1, (PFS_PSEL_CEU | R_PFS_PMR)}
#define GPIO_VIO_D2                         (gpio_pinset_t){ PORT4,PIN5, (PFS_PSEL_CEU | R_PFS_PMR)}
#define GPIO_VIO_D3_1                       (gpio_pinset_t){ PORT4,PIN4, (PFS_PSEL_CEU | R_PFS_PMR)}
#define GPIO_VIO_D3_2                       (gpio_pinset_t){ PORT4,PIN6, (PFS_PSEL_CEU | R_PFS_PMR)}
#define GPIO_VIO_D4                         (gpio_pinset_t){ PORT7,PIN0, (PFS_PSEL_CEU | R_PFS_PMR)}
#define GPIO_VIO_D5                         (gpio_pinset_t){ PORT7,PIN1, (PFS_PSEL_CEU | R_PFS_PMR)}
#define GPIO_VIO_D6                         (gpio_pinset_t){ PORT7,PIN2, (PFS_PSEL_CEU | R_PFS_PMR)}
#define GPIO_VIO_D7                         (gpio_pinset_t){ PORT7,PIN3, (PFS_PSEL_CEU | R_PFS_PMR)}

