nguyentri/nuttx/arch/arm/src/ra8/hardware/ra8e1/ra8e1_pinmap.h
/* GPT Delta-Sigma Modulator Functions */
#define GPIO_GTADSM0_1                      (gpio_pinset_t){ PORT3,PIN12, (PFS_PSEL_GPT | R_PFS_PMR)}
#define GPIO_GTADSM0_2                      (gpio_pinset_t){ PORT4,PIN15, (PFS_PSEL_GPT | R_PFS_PMR)}
#define GPIO_GTADSM0_3                      (gpio_pinset_t){ PORT7,PIN4, (PFS_PSEL_GPT | R_PFS_PMR)}
#define GPIO_GTADSM1_1                      (gpio_pinset_t){ PORT3,PIN11, (PFS_PSEL_GPT | R_PFS_PMR)}
#define GPIO_GTADSM1_2                      (gpio_pinset_t){ PORT4,PIN14, (PFS_PSEL_GPT | R_PFS_PMR)}
#define GPIO_GTADSM1_3                      (gpio_pinset_t){ PORT7,PIN5, (PFS_PSEL_GPT | R_PFS_PMR)}
#define GPIO_SDA1_MOSI1_TXD1_A              (gpio_pinset_t){ PORT2,PIN5, (PFS_PSEL_IIC | R_PFS_PMR)}
#define GPIO_SDA1_MOSI1_TXD1_B              (gpio_pinset_t){ PORT4,PIN9, (PFS_PSEL_IIC | R_PFS_PMR)}
#define GPIO_SDA1_MOSI1_TXD1_C              (gpio_pinset_t){ PORT5,PIN11, (PFS_PSEL_IIC | R_PFS_PMR)}

#define GPIO_SCL1_MISO1_RXD1_A              (gpio_pinset_t){ PORT2,PIN6, (PFS_PSEL_IIC | R_PFS_PMR)}
#define GPIO_SCL1_MISO1_RXD1_B              (gpio_pinset_t){ PORT4,PIN8, (PFS_PSEL_IIC | R_PFS_PMR)}
#define GPIO_SCL1_MISO1_RXD1_C              (gpio_pinset_t){ PORT5,PIN12, (PFS_PSEL_IIC | R_PFS_PMR)}

#define GPIO_SDA0_A                         (gpio_pinset_t){ PORT4,PIN9, (PFS_PSEL_IIC | R_PFS_PMR)}
#define GPIO_SDA0_B                         (gpio_pinset_t){ PORT4,PIN7, (PFS_PSEL_IIC | R_PFS_PMR)}

#define GPIO_SCL0_A                         (gpio_pinset_t){ PORT4,PIN10, (PFS_PSEL_IIC | R_PFS_PMR)}
#define GPIO_SCL0_B                         (gpio_pinset_t){ PORT4,PIN8, (PFS_PSEL_IIC | R_PFS_PMR)}

/* ADC Alternative Functions */
#define GPIO_AN000_1                        (gpio_pinset_t){ PORT0,PIN4, (0 | R_PFS_ASEL)}
#define GPIO_AN001_1                        (gpio_pinset_t){ PORT0,PIN5, (0 | R_PFS_ASEL)}
#define GPIO_AN002_1                        (gpio_pinset_t){ PORT0,PIN6, (0 | R_PFS_ASEL)}
#define GPIO_AN004_1                        (gpio_pinset_t){ PORT0,PIN7, (0 | R_PFS_ASEL)}
#define GPIO_AN005_1                        (gpio_pinset_t){ PORT0,PIN10, (0 | R_PFS_ASEL)}
#define GPIO_AN006_1                        (gpio_pinset_t){ PORT0,PIN9, (0 | R_PFS_ASEL)}
#define GPIO_AN007_1                        (gpio_pinset_t){ PORT0,PIN14, (0 | R_PFS_ASEL)}
#define GPIO_AN008_1                        (gpio_pinset_t){ PORT0,PIN8, (0 | R_PFS_ASEL)}
#define GPIO_AN100_1                        (gpio_pinset_t){ PORT0,PIN0, (0 | R_PFS_ASEL)}
#define GPIO_AN101_1                        (gpio_pinset_t){ PORT0,PIN1, (0 | R_PFS_ASEL)}
#define GPIO_AN102_1                        (gpio_pinset_t){ PORT0,PIN2, (0 | R_PFS_ASEL)}
#define GPIO_AN104_1                        (gpio_pinset_t){ PORT0,PIN3, (0 | R_PFS_ASEL)}
#define GPIO_AN105_1                        (gpio_pinset_t){ PORT0,PIN15, (0 | R_PFS_ASEL)}

/* General Purpose GPIO Pin Definitions */
#define GPIO_P004_OUTPUT_HIGH               (gpio_pinset_t){ PORT0, PIN4, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_HIGH)}
#define GPIO_P004_OUTPUT_LOW                (gpio_pinset_t){ PORT0, PIN4, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_LOW)}
#define GPIO_P004_INPUT                     (gpio_pinset_t){ PORT0, PIN4, (GPIO_INPUT)}
#define GPIO_P004_INPUT_PULLUP              (gpio_pinset_t){ PORT0, PIN4, (GPIO_INPUT | R_PFS_PCR)}

#define GPIO_P006_OUTPUT_HIGH               (gpio_pinset_t){ PORT0, PIN6, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_HIGH)}
#define GPIO_P006_OUTPUT_LOW                (gpio_pinset_t){ PORT0, PIN6, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_LOW)}
#define GPIO_P006_INPUT                     (gpio_pinset_t){ PORT0, PIN6, (GPIO_INPUT)}
#define GPIO_P006_INPUT_PULLUP              (gpio_pinset_t){ PORT0, PIN6, (GPIO_INPUT | R_PFS_PCR)}
#define GPIO_P006_INT_RISING                (gpio_pinset_t){ PORT0, PIN6, (GPIO_INPUT | R_PFS_PCR | R_PFS_ISEL)}
#define GPIO_P006_INT_FALLING               (gpio_pinset_t){ PORT0, PIN6, (GPIO_INPUT | R_PFS_PCR | R_PFS_ISEL | R_PFS_EOF)}

#define GPIO_P009_OUTPUT_HIGH               (gpio_pinset_t){ PORT0, PIN9, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_HIGH)}
#define GPIO_P009_OUTPUT_LOW                (gpio_pinset_t){ PORT0, PIN9, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_LOW)}
#define GPIO_P009_INPUT                     (gpio_pinset_t){ PORT0, PIN9, (GPIO_INPUT)}
#define GPIO_P009_INPUT_PULLUP              (gpio_pinset_t){ PORT0, PIN9, (GPIO_INPUT | R_PFS_PCR)}
#define GPIO_P009_INT_FALLING               (gpio_pinset_t){ PORT0, PIN9, (GPIO_INPUT | R_PFS_PCR | R_PFS_ISEL | R_PFS_EOF)}

#define GPIO_P303_OUTPUT_HIGH               (gpio_pinset_t){ PORT3, PIN3, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_HIGH)}
#define GPIO_P303_OUTPUT_LOW                (gpio_pinset_t){ PORT3, PIN3, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_LOW)}
#define GPIO_P303_INPUT                     (gpio_pinset_t){ PORT3, PIN3, (GPIO_INPUT)}
#define GPIO_P303_INPUT_PULLUP              (gpio_pinset_t){ PORT3, PIN3, (GPIO_INPUT | R_PFS_PCR)}

#define GPIO_P404_OUTPUT_HIGH               (gpio_pinset_t){ PORT4, PIN4, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_HIGH)}
#define GPIO_P404_OUTPUT_LOW                (gpio_pinset_t){ PORT4, PIN4, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_LOW)}
#define GPIO_P404_INPUT                     (gpio_pinset_t){ PORT4, PIN4, (GPIO_INPUT)}

#define GPIO_P408_OUTPUT_HIGH               (gpio_pinset_t){ PORT4, PIN8, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_HIGH)}
#define GPIO_P408_OUTPUT_LOW                (gpio_pinset_t){ PORT4, PIN8, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_LOW)}
#define GPIO_P408_INPUT                     (gpio_pinset_t){ PORT4, PIN8, (GPIO_INPUT)}

#define GPIO_P410_OUTPUT_HIGH               (gpio_pinset_t){ PORT4, PIN10, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_HIGH)}
#define GPIO_P410_OUTPUT_LOW                (gpio_pinset_t){ PORT4, PIN10, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_LOW)}
#define GPIO_P410_INPUT                     (gpio_pinset_t){ PORT4, PIN10, (GPIO_INPUT)}

#define GPIO_P411_OUTPUT_HIGH               (gpio_pinset_t){ PORT4, PIN11, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_HIGH)}
#define GPIO_P411_OUTPUT_LOW                (gpio_pinset_t){ PORT4, PIN11, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_LOW)}
#define GPIO_P411_INPUT                     (gpio_pinset_t){ PORT4, PIN11, (GPIO_INPUT)}

#define GPIO_P412_OUTPUT_HIGH               (gpio_pinset_t){ PORT4, PIN12, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_HIGH)}
#define GPIO_P412_OUTPUT_LOW                (gpio_pinset_t){ PORT4, PIN12, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_LOW)}
#define GPIO_P412_INPUT                     (gpio_pinset_t){ PORT4, PIN12, (GPIO_INPUT)}

#define GPIO_P605_OUTPUT_HIGH               (gpio_pinset_t){ PORT6, PIN5, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_HIGH)}
#define GPIO_P605_OUTPUT_LOW                (gpio_pinset_t){ PORT6, PIN5, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_LOW)}
#define GPIO_P605_INPUT                     (gpio_pinset_t){ PORT6, PIN5, (GPIO_INPUT)}

#define GPIO_P905_OUTPUT_HIGH               (gpio_pinset_t){ PORT9, PIN5, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_HIGH)}
#define GPIO_P905_OUTPUT_LOW                (gpio_pinset_t){ PORT9, PIN5, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_LOW)}
#define GPIO_P905_INPUT                     (gpio_pinset_t){ PORT9, PIN5, (GPIO_INPUT)}

#define GPIO_P113_RXD0_A                    (gpio_pinset_t){ PORT1, PIN13, (PFS_PSEL_SCI | R_PFS_PMR)}
#define GPIO_P113_MISO0_A                   (gpio_pinset_t){ PORT1, PIN13, (PFS_PSEL_SCI | R_PFS_PMR)}
#define GPIO_P113_SCL0_A                    (gpio_pinset_t){ PORT1, PIN13, (PFS_PSEL_SCI | R_PFS_PMR)}
#define GPIO_P113_SSLA1_B                   (gpio_pinset_t){ PORT1, PIN13, (PFS_PSEL_SPI | R_PFS_PMR)}
#define GPIO_P113_SSILRCK0                  (gpio_pinset_t){ PORT1, PIN13, (PFS_PSEL_SSI | R_PFS_PMR)}

/* P114 Alternate Functions: CTS0_RTS0_A/SS0_A, DE0, SSLA0_B, SSIRXD0_B, ET0_LINKSTA */
#define GPIO_P114_CTS0_RTS0_A               (gpio_pinset_t){ PORT1, PIN14, (PFS_PSEL_SCI | R_PFS_PMR)}
#define GPIO_P114_SS0_A                     (gpio_pinset_t){ PORT1, PIN14, (PFS_PSEL_SCI | R_PFS_PMR)}
#define GPIO_P114_SSLA0_B                   (gpio_pinset_t){ PORT1, PIN14, (PFS_PSEL_SPI | R_PFS_PMR)}
#define GPIO_P114_SSIRXD0_B                 (gpio_pinset_t){ PORT1, PIN14, (PFS_PSEL_SSI | R_PFS_PMR)}

/* External Interrupt Pin Definitions */
#define GPIO_IRQ0_P105                      (gpio_pinset_t){ PORT1, PIN5, (GPIO_INPUT | R_PFS_PCR | R_PFS_ISEL)}
#define GPIO_IRQ0_P206                      (gpio_pinset_t){ PORT2, PIN6, (GPIO_INPUT | R_PFS_PCR | R_PFS_ISEL)}
#define GPIO_IRQ0_P400                      (gpio_pinset_t){ PORT4, PIN0, (GPIO_INPUT | R_PFS_PCR | R_PFS_ISEL)}
#define GPIO_IRQ0_P806                      (gpio_pinset_t){ PORT8, PIN6, (GPIO_INPUT | R_PFS_PCR | R_PFS_ISEL)}

#define GPIO_IRQ1_P101                      (gpio_pinset_t){ PORT1, PIN1, (GPIO_INPUT | R_PFS_PCR | R_PFS_ISEL)}
#define GPIO_IRQ1_P104                      (gpio_pinset_t){ PORT1, PIN4, (GPIO_INPUT | R_PFS_PCR | R_PFS_ISEL)}
#define GPIO_IRQ1_P205                      (gpio_pinset_t){ PORT2, PIN5, (GPIO_INPUT | R_PFS_PCR | R_PFS_ISEL)}

#define GPIO_IRQ2_P100                      (gpio_pinset_t){ PORT1, PIN0, (GPIO_INPUT | R_PFS_PCR | R_PFS_ISEL)}
#define GPIO_IRQ2_P203                      (gpio_pinset_t){ PORT2, PIN3, (GPIO_INPUT | R_PFS_PCR | R_PFS_ISEL)}
#define GPIO_IRQ2_P212                      (gpio_pinset_t){ PORT2, PIN12, (GPIO_INPUT | R_PFS_PCR | R_PFS_ISEL)}

#define GPIO_IRQ3_P202                      (gpio_pinset_t){ PORT2, PIN2, (GPIO_INPUT | R_PFS_PCR | R_PFS_ISEL)}
#define GPIO_IRQ3_P208                      (gpio_pinset_t){ PORT2, PIN8, (GPIO_INPUT | R_PFS_PCR | R_PFS_ISEL)}
#define GPIO_IRQ3_P211                      (gpio_pinset_t){ PORT2, PIN11, (GPIO_INPUT | R_PFS_PCR | R_PFS_ISEL)}

