nguyentri/nuttx/arch/arm/src/ra8/hardware/ra8e1/ra8e1_pinmap.h
#define GPIO_IRQ4_P300                      (gpio_pinset_t){ PORT3, PIN0, (GPIO_INPUT | R_PFS_PCR | R_PFS_ISEL)}
#define GPIO_IRQ4_P402                      (gpio_pinset_t){ PORT4, PIN2, (GPIO_INPUT | R_PFS_PCR | R_PFS_ISEL)}
#define GPIO_IRQ4_P411                      (gpio_pinset_t){ PORT4, PIN11, (GPIO_INPUT | R_PFS_PCR | R_PFS_ISEL)}

#define GPIO_IRQ5_P302                      (gpio_pinset_t){ PORT3, PIN2, (GPIO_INPUT | R_PFS_PCR | R_PFS_ISEL)}
#define GPIO_IRQ5_P401                      (gpio_pinset_t){ PORT4, PIN1, (GPIO_INPUT | R_PFS_PCR | R_PFS_ISEL)}
#define GPIO_IRQ5_P410                      (gpio_pinset_t){ PORT4, PIN10, (GPIO_INPUT | R_PFS_PCR | R_PFS_ISEL)}

#define GPIO_IRQ6_P301                      (gpio_pinset_t){ PORT3, PIN1, (GPIO_INPUT | R_PFS_PCR | R_PFS_ISEL)}
#define GPIO_IRQ6_P409                      (gpio_pinset_t){ PORT4, PIN9, (GPIO_INPUT | R_PFS_PCR | R_PFS_ISEL)}

#define GPIO_IRQ7_P408                      (gpio_pinset_t){ PORT4, PIN8, (GPIO_INPUT | R_PFS_PCR | R_PFS_ISEL)}

#define GPIO_IRQ8_P305                      (gpio_pinset_t){ PORT3, PIN5, (GPIO_INPUT | R_PFS_PCR | R_PFS_ISEL)}
#define GPIO_IRQ8_P415                      (gpio_pinset_t){ PORT4, PIN15, (GPIO_INPUT | R_PFS_PCR | R_PFS_ISEL)}

#define GPIO_IRQ9_P304                      (gpio_pinset_t){ PORT3, PIN4, (GPIO_INPUT | R_PFS_PCR | R_PFS_ISEL)}
#define GPIO_IRQ9_P414                      (gpio_pinset_t){ PORT4, PIN14, (GPIO_INPUT | R_PFS_PCR | R_PFS_ISEL)}

#define GPIO_IRQ10_P709                     (gpio_pinset_t){ PORT7, PIN9, (GPIO_INPUT | R_PFS_PCR | R_PFS_ISEL)}

#define GPIO_IRQ11_P708                     (gpio_pinset_t){ PORT7, PIN8, (GPIO_INPUT | R_PFS_PCR | R_PFS_ISEL)}
#define GPIO_IRQ11_P800                     (gpio_pinset_t){ PORT8, PIN0, (GPIO_INPUT | R_PFS_PCR | R_PFS_ISEL)}

#define GPIO_IRQ12_P801                     (gpio_pinset_t){ PORT8, PIN1, (GPIO_INPUT | R_PFS_PCR | R_PFS_ISEL)}

#define GPIO_IRQ13_P009                     (gpio_pinset_t){ PORT0, PIN9, (GPIO_INPUT | R_PFS_PCR | R_PFS_ISEL)}
#define GPIO_IRQ13_P014                     (gpio_pinset_t){ PORT0, PIN14, (GPIO_INPUT | R_PFS_PCR | R_PFS_ISEL)}

#define GPIO_IRQ14_P010                     (gpio_pinset_t){ PORT0, PIN10, (GPIO_INPUT | R_PFS_PCR | R_PFS_ISEL)}
#define GPIO_IRQ14_P403                     (gpio_pinset_t){ PORT4, PIN3, (GPIO_INPUT | R_PFS_PCR | R_PFS_ISEL)}
#define GPIO_IRQ14_P512                     (gpio_pinset_t){ PORT5, PIN12, (GPIO_INPUT | R_PFS_PCR | R_PFS_ISEL)}
#define GPIO_IRQ14_P804                     (gpio_pinset_t){ PORT8, PIN4, (GPIO_INPUT | R_PFS_PCR | R_PFS_ISEL)}

#define GPIO_IRQ15_P404                     (gpio_pinset_t){ PORT4, PIN4, (GPIO_INPUT | R_PFS_PCR | R_PFS_ISEL)}
#define GPIO_IRQ15_P511                     (gpio_pinset_t){ PORT5, PIN11, (GPIO_INPUT | R_PFS_PCR | R_PFS_ISEL)}
#define GPIO_IRQ15_P808                     (gpio_pinset_t){ PORT8, PIN8, (GPIO_INPUT | R_PFS_PCR | R_PFS_ISEL)}

/* Missing IRQ definitions from CSV */
#define GPIO_IRQ6_P000                      (gpio_pinset_t){ PORT0, PIN0, (GPIO_INPUT | R_PFS_PCR | R_PFS_ISEL)}
#define GPIO_IRQ7_P001                      (gpio_pinset_t){ PORT0, PIN1, (GPIO_INPUT | R_PFS_PCR | R_PFS_ISEL)}
#define GPIO_IRQ8_P002                      (gpio_pinset_t){ PORT0, PIN2, (GPIO_INPUT | R_PFS_PCR | R_PFS_ISEL)}
#define GPIO_IRQ8_P008                      (gpio_pinset_t){ PORT0, PIN8, (GPIO_INPUT | R_PFS_PCR | R_PFS_ISEL)}
#define GPIO_IRQ9_P004                      (gpio_pinset_t){ PORT0, PIN4, (GPIO_INPUT | R_PFS_PCR | R_PFS_ISEL)}
#define GPIO_IRQ10_P005                     (gpio_pinset_t){ PORT0, PIN5, (GPIO_INPUT | R_PFS_PCR | R_PFS_ISEL)}
#define GPIO_IRQ11_P006                     (gpio_pinset_t){ PORT0, PIN6, (GPIO_INPUT | R_PFS_PCR | R_PFS_ISEL)}
#define GPIO_IRQ12_P008                     (gpio_pinset_t){ PORT0, PIN8, (GPIO_INPUT | R_PFS_PCR | R_PFS_ISEL)}
#define GPIO_IRQ15_P015                     (gpio_pinset_t){ PORT0, PIN15, (GPIO_INPUT | R_PFS_PCR | R_PFS_ISEL)}

/* IRQ with DS (Deep Standby) capability */
#define GPIO_IRQ1_P205_DS                   (gpio_pinset_t){ PORT2, PIN5, (GPIO_INPUT | R_PFS_PCR | R_PFS_ISEL)}
#define GPIO_IRQ2_P203_DS                   (gpio_pinset_t){ PORT2, PIN3, (GPIO_INPUT | R_PFS_PCR | R_PFS_ISEL)}
#define GPIO_IRQ3_P202_DS                   (gpio_pinset_t){ PORT2, PIN2, (GPIO_INPUT | R_PFS_PCR | R_PFS_ISEL)}
#define GPIO_IRQ4_P402_DS                   (gpio_pinset_t){ PORT4, PIN2, (GPIO_INPUT | R_PFS_PCR | R_PFS_ISEL)}
#define GPIO_IRQ5_P401_DS                   (gpio_pinset_t){ PORT4, PIN1, (GPIO_INPUT | R_PFS_PCR | R_PFS_ISEL)}
#define GPIO_IRQ14_P403_DS                  (gpio_pinset_t){ PORT4, PIN3, (GPIO_INPUT | R_PFS_PCR | R_PFS_ISEL)}
#define GPIO_IRQ15_P404_DS                  (gpio_pinset_t){ PORT4, PIN4, (GPIO_INPUT | R_PFS_PCR | R_PFS_ISEL)}

/* PORT 0 Pin Definitions */
#define GPIO_P000_OUTPUT_HIGH               (gpio_pinset_t){ PORT0, PIN0, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_HIGH)}
#define GPIO_P000_OUTPUT_LOW                (gpio_pinset_t){ PORT0, PIN0, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_LOW)}
#define GPIO_P000_INPUT                     (gpio_pinset_t){ PORT0, PIN0, (GPIO_INPUT)}
#define GPIO_P000_INPUT_PULLUP              (gpio_pinset_t){ PORT0, PIN0, (GPIO_INPUT | R_PFS_PCR)}
#define GPIO_P000_ANALOG                    (gpio_pinset_t){ PORT0, PIN0, (0 | R_PFS_ASEL)}

#define GPIO_P001_OUTPUT_HIGH               (gpio_pinset_t){ PORT0, PIN1, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_HIGH)}
#define GPIO_P001_OUTPUT_LOW                (gpio_pinset_t){ PORT0, PIN1, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_LOW)}
#define GPIO_P001_INPUT                     (gpio_pinset_t){ PORT0, PIN1, (GPIO_INPUT)}
#define GPIO_P001_INPUT_PULLUP              (gpio_pinset_t){ PORT0, PIN1, (GPIO_INPUT | R_PFS_PCR)}
#define GPIO_P001_ANALOG                    (gpio_pinset_t){ PORT0, PIN1, (0 | R_PFS_ASEL)}

#define GPIO_P002_OUTPUT_HIGH               (gpio_pinset_t){ PORT0, PIN2, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_HIGH)}
#define GPIO_P002_OUTPUT_LOW                (gpio_pinset_t){ PORT0, PIN2, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_LOW)}
#define GPIO_P002_INPUT                     (gpio_pinset_t){ PORT0, PIN2, (GPIO_INPUT)}
#define GPIO_P002_INPUT_PULLUP              (gpio_pinset_t){ PORT0, PIN2, (GPIO_INPUT | R_PFS_PCR)}
#define GPIO_P002_ANALOG                    (gpio_pinset_t){ PORT0, PIN2, (0 | R_PFS_ASEL)}

#define GPIO_P003_OUTPUT_HIGH               (gpio_pinset_t){ PORT0, PIN3, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_HIGH)}
#define GPIO_P003_OUTPUT_LOW                (gpio_pinset_t){ PORT0, PIN3, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_LOW)}
#define GPIO_P003_INPUT                     (gpio_pinset_t){ PORT0, PIN3, (GPIO_INPUT)}
#define GPIO_P003_INPUT_PULLUP              (gpio_pinset_t){ PORT0, PIN3, (GPIO_INPUT | R_PFS_PCR)}
#define GPIO_P003_ANALOG                    (gpio_pinset_t){ PORT0, PIN3, (0 | R_PFS_ASEL)}

#define GPIO_P005_OUTPUT_HIGH               (gpio_pinset_t){ PORT0, PIN5, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_HIGH)}
#define GPIO_P005_OUTPUT_LOW                (gpio_pinset_t){ PORT0, PIN5, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_LOW)}
#define GPIO_P005_INPUT                     (gpio_pinset_t){ PORT0, PIN5, (GPIO_INPUT)}
#define GPIO_P005_INPUT_PULLUP              (gpio_pinset_t){ PORT0, PIN5, (GPIO_INPUT | R_PFS_PCR)}
#define GPIO_P005_ANALOG                    (gpio_pinset_t){ PORT0, PIN5, (0 | R_PFS_ASEL)}

