nguyentri/nuttx/arch/arm/src/ra8/hardware/ra8e1/ra8e1_pinmap.h
#define GPIO_P007_OUTPUT_HIGH               (gpio_pinset_t){ PORT0, PIN7, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_HIGH)}
#define GPIO_P007_OUTPUT_LOW                (gpio_pinset_t){ PORT0, PIN7, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_LOW)}
#define GPIO_P007_INPUT                     (gpio_pinset_t){ PORT0, PIN7, (GPIO_INPUT)}
#define GPIO_P007_INPUT_PULLUP              (gpio_pinset_t){ PORT0, PIN7, (GPIO_INPUT | R_PFS_PCR)}
#define GPIO_P007_ANALOG                    (gpio_pinset_t){ PORT0, PIN7, (0 | R_PFS_ASEL)}

#define GPIO_P008_OUTPUT_HIGH               (gpio_pinset_t){ PORT0, PIN8, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_HIGH)}
#define GPIO_P008_OUTPUT_LOW                (gpio_pinset_t){ PORT0, PIN8, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_LOW)}
#define GPIO_P008_INPUT                     (gpio_pinset_t){ PORT0, PIN8, (GPIO_INPUT)}
#define GPIO_P008_INPUT_PULLUP              (gpio_pinset_t){ PORT0, PIN8, (GPIO_INPUT | R_PFS_PCR)}
#define GPIO_P008_ANALOG                    (gpio_pinset_t){ PORT0, PIN8, (0 | R_PFS_ASEL)}

#define GPIO_P010_OUTPUT_HIGH               (gpio_pinset_t){ PORT0, PIN10, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_HIGH)}
#define GPIO_P010_OUTPUT_LOW                (gpio_pinset_t){ PORT0, PIN10, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_LOW)}
#define GPIO_P010_INPUT                     (gpio_pinset_t){ PORT0, PIN10, (GPIO_INPUT)}
#define GPIO_P010_INPUT_PULLUP              (gpio_pinset_t){ PORT0, PIN10, (GPIO_INPUT | R_PFS_PCR)}
#define GPIO_P010_ANALOG                    (gpio_pinset_t){ PORT0, PIN10, (0 | R_PFS_ASEL)}

#define GPIO_P014_OUTPUT_HIGH               (gpio_pinset_t){ PORT0, PIN14, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_HIGH)}
#define GPIO_P014_OUTPUT_LOW                (gpio_pinset_t){ PORT0, PIN14, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_LOW)}
#define GPIO_P014_INPUT                     (gpio_pinset_t){ PORT0, PIN14, (GPIO_INPUT)}
#define GPIO_P014_INPUT_PULLUP              (gpio_pinset_t){ PORT0, PIN14, (GPIO_INPUT | R_PFS_PCR)}
#define GPIO_P014_ANALOG                    (gpio_pinset_t){ PORT0, PIN14, (0 | R_PFS_ASEL)}

#define GPIO_P015_OUTPUT_HIGH               (gpio_pinset_t){ PORT0, PIN15, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_HIGH)}
#define GPIO_P015_OUTPUT_LOW                (gpio_pinset_t){ PORT0, PIN15, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_LOW)}
#define GPIO_P015_INPUT                     (gpio_pinset_t){ PORT0, PIN15, (GPIO_INPUT)}
#define GPIO_P015_INPUT_PULLUP              (gpio_pinset_t){ PORT0, PIN15, (GPIO_INPUT | R_PFS_PCR)}
#define GPIO_P015_ANALOG                    (gpio_pinset_t){ PORT0, PIN15, (0 | R_PFS_ASEL)}

/* PORT 1 Pin Definitions */
#define GPIO_P100_OUTPUT_HIGH               (gpio_pinset_t){ PORT1, PIN0, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_HIGH)}
#define GPIO_P100_OUTPUT_LOW                (gpio_pinset_t){ PORT1, PIN0, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_LOW)}
#define GPIO_P100_INPUT                     (gpio_pinset_t){ PORT1, PIN0, (GPIO_INPUT)}
#define GPIO_P100_INPUT_PULLUP              (gpio_pinset_t){ PORT1, PIN0, (GPIO_INPUT | R_PFS_PCR)}

#define GPIO_P101_OUTPUT_HIGH               (gpio_pinset_t){ PORT1, PIN1, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_HIGH)}
#define GPIO_P101_OUTPUT_LOW                (gpio_pinset_t){ PORT1, PIN1, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_LOW)}
#define GPIO_P101_INPUT                     (gpio_pinset_t){ PORT1, PIN1, (GPIO_INPUT)}
#define GPIO_P101_INPUT_PULLUP              (gpio_pinset_t){ PORT1, PIN1, (GPIO_INPUT | R_PFS_PCR)}

#define GPIO_P102_OUTPUT_HIGH               (gpio_pinset_t){ PORT1, PIN2, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_HIGH)}
#define GPIO_P102_OUTPUT_LOW                (gpio_pinset_t){ PORT1, PIN2, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_LOW)}
#define GPIO_P102_INPUT                     (gpio_pinset_t){ PORT1, PIN2, (GPIO_INPUT)}
#define GPIO_P102_INPUT_PULLUP              (gpio_pinset_t){ PORT1, PIN2, (GPIO_INPUT | R_PFS_PCR)}

#define GPIO_P103_OUTPUT_HIGH               (gpio_pinset_t){ PORT1, PIN3, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_HIGH)}
#define GPIO_P103_OUTPUT_LOW                (gpio_pinset_t){ PORT1, PIN3, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_LOW)}
#define GPIO_P103_INPUT                     (gpio_pinset_t){ PORT1, PIN3, (GPIO_INPUT)}
#define GPIO_P103_INPUT_PULLUP              (gpio_pinset_t){ PORT1, PIN3, (GPIO_INPUT | R_PFS_PCR)}

#define GPIO_P104_OUTPUT_HIGH               (gpio_pinset_t){ PORT1, PIN4, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_HIGH)}
#define GPIO_P104_OUTPUT_LOW                (gpio_pinset_t){ PORT1, PIN4, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_LOW)}
#define GPIO_P104_INPUT                     (gpio_pinset_t){ PORT1, PIN4, (GPIO_INPUT)}
#define GPIO_P104_INPUT_PULLUP              (gpio_pinset_t){ PORT1, PIN4, (GPIO_INPUT | R_PFS_PCR)}

#define GPIO_P105_OUTPUT_HIGH               (gpio_pinset_t){ PORT1, PIN5, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_HIGH)}
#define GPIO_P105_OUTPUT_LOW                (gpio_pinset_t){ PORT1, PIN5, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_LOW)}
#define GPIO_P105_INPUT                     (gpio_pinset_t){ PORT1, PIN5, (GPIO_INPUT)}
#define GPIO_P105_INPUT_PULLUP              (gpio_pinset_t){ PORT1, PIN5, (GPIO_INPUT | R_PFS_PCR)}

#define GPIO_P106_OUTPUT_HIGH               (gpio_pinset_t){ PORT1, PIN6, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_HIGH)}
#define GPIO_P106_OUTPUT_LOW                (gpio_pinset_t){ PORT1, PIN6, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_LOW)}
#define GPIO_P106_INPUT                     (gpio_pinset_t){ PORT1, PIN6, (GPIO_INPUT)}
#define GPIO_P106_INPUT_PULLUP              (gpio_pinset_t){ PORT1, PIN6, (GPIO_INPUT | R_PFS_PCR)}

#define GPIO_P107_OUTPUT_HIGH               (gpio_pinset_t){ PORT1, PIN7, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_HIGH)}
#define GPIO_P107_OUTPUT_LOW                (gpio_pinset_t){ PORT1, PIN7, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_LOW)}
#define GPIO_P107_INPUT                     (gpio_pinset_t){ PORT1, PIN7, (GPIO_INPUT)}
#define GPIO_P107_INPUT_PULLUP              (gpio_pinset_t){ PORT1, PIN7, (GPIO_INPUT | R_PFS_PCR)}

#define GPIO_P112_OUTPUT_HIGH               (gpio_pinset_t){ PORT1, PIN12, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_HIGH)}
#define GPIO_P112_OUTPUT_LOW                (gpio_pinset_t){ PORT1, PIN12, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_LOW)}
#define GPIO_P112_INPUT                     (gpio_pinset_t){ PORT1, PIN12, (GPIO_INPUT)}
#define GPIO_P112_INPUT_PULLUP              (gpio_pinset_t){ PORT1, PIN12, (GPIO_INPUT | R_PFS_PCR)}

#define GPIO_P113_OUTPUT_HIGH               (gpio_pinset_t){ PORT1, PIN13, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_HIGH)}
#define GPIO_P113_OUTPUT_LOW                (gpio_pinset_t){ PORT1, PIN13, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_LOW)}
#define GPIO_P113_INPUT                     (gpio_pinset_t){ PORT1, PIN13, (GPIO_INPUT)}
#define GPIO_P113_INPUT_PULLUP              (gpio_pinset_t){ PORT1, PIN13, (GPIO_INPUT | R_PFS_PCR)}

#define GPIO_P114_OUTPUT_HIGH               (gpio_pinset_t){ PORT1, PIN14, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_HIGH)}
#define GPIO_P114_OUTPUT_LOW                (gpio_pinset_t){ PORT1, PIN14, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_LOW)}
#define GPIO_P114_INPUT                     (gpio_pinset_t){ PORT1, PIN14, (GPIO_INPUT)}
#define GPIO_P114_INPUT_PULLUP              (gpio_pinset_t){ PORT1, PIN14, (GPIO_INPUT | R_PFS_PCR)}

#define GPIO_P115_OUTPUT_HIGH               (gpio_pinset_t){ PORT1, PIN15, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_HIGH)}
#define GPIO_P115_OUTPUT_LOW                (gpio_pinset_t){ PORT1, PIN15, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_LOW)}
#define GPIO_P115_INPUT                     (gpio_pinset_t){ PORT1, PIN15, (GPIO_INPUT)}
#define GPIO_P115_INPUT_PULLUP              (gpio_pinset_t){ PORT1, PIN15, (GPIO_INPUT | R_PFS_PCR)}

