nguyentri/nuttx/arch/arm/src/ra8/hardware/ra8e1/ra8e1_pinmap.h
/* PORT 2 Pin Definitions */
#define GPIO_P200_OUTPUT_HIGH               (gpio_pinset_t){ PORT2, PIN0, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_HIGH)}
#define GPIO_P200_OUTPUT_LOW                (gpio_pinset_t){ PORT2, PIN0, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_LOW)}
#define GPIO_P200_INPUT                     (gpio_pinset_t){ PORT2, PIN0, (GPIO_INPUT)}
#define GPIO_P200_INPUT_PULLUP              (gpio_pinset_t){ PORT2, PIN0, (GPIO_INPUT | R_PFS_PCR)}

#define GPIO_P201_OUTPUT_HIGH               (gpio_pinset_t){ PORT2, PIN1, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_HIGH)}
#define GPIO_P201_OUTPUT_LOW                (gpio_pinset_t){ PORT2, PIN1, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_LOW)}
#define GPIO_P201_INPUT                     (gpio_pinset_t){ PORT2, PIN1, (GPIO_INPUT)}
#define GPIO_P201_INPUT_PULLUP              (gpio_pinset_t){ PORT2, PIN1, (GPIO_INPUT | R_PFS_PCR)}

#define GPIO_P202_OUTPUT_HIGH               (gpio_pinset_t){ PORT2, PIN2, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_HIGH)}
#define GPIO_P202_OUTPUT_LOW                (gpio_pinset_t){ PORT2, PIN2, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_LOW)}
#define GPIO_P202_INPUT                     (gpio_pinset_t){ PORT2, PIN2, (GPIO_INPUT)}
#define GPIO_P202_INPUT_PULLUP              (gpio_pinset_t){ PORT2, PIN2, (GPIO_INPUT | R_PFS_PCR)}

#define GPIO_P203_OUTPUT_HIGH               (gpio_pinset_t){ PORT2, PIN3, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_HIGH)}
#define GPIO_P203_OUTPUT_LOW                (gpio_pinset_t){ PORT2, PIN3, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_LOW)}
#define GPIO_P203_INPUT                     (gpio_pinset_t){ PORT2, PIN3, (GPIO_INPUT)}
#define GPIO_P203_INPUT_PULLUP              (gpio_pinset_t){ PORT2, PIN3, (GPIO_INPUT | R_PFS_PCR)}

#define GPIO_P204_OUTPUT_HIGH               (gpio_pinset_t){ PORT2, PIN4, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_HIGH)}
#define GPIO_P204_OUTPUT_LOW                (gpio_pinset_t){ PORT2, PIN4, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_LOW)}
#define GPIO_P204_INPUT                     (gpio_pinset_t){ PORT2, PIN4, (GPIO_INPUT)}
#define GPIO_P204_INPUT_PULLUP              (gpio_pinset_t){ PORT2, PIN4, (GPIO_INPUT | R_PFS_PCR)}

#define GPIO_P205_OUTPUT_HIGH               (gpio_pinset_t){ PORT2, PIN5, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_HIGH)}
#define GPIO_P205_OUTPUT_LOW                (gpio_pinset_t){ PORT2, PIN5, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_LOW)}
#define GPIO_P205_INPUT                     (gpio_pinset_t){ PORT2, PIN5, (GPIO_INPUT)}
#define GPIO_P205_INPUT_PULLUP              (gpio_pinset_t){ PORT2, PIN5, (GPIO_INPUT | R_PFS_PCR)}

#define GPIO_P206_OUTPUT_HIGH               (gpio_pinset_t){ PORT2, PIN6, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_HIGH)}
#define GPIO_P206_OUTPUT_LOW                (gpio_pinset_t){ PORT2, PIN6, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_LOW)}
#define GPIO_P206_INPUT                     (gpio_pinset_t){ PORT2, PIN6, (GPIO_INPUT)}
#define GPIO_P206_INPUT_PULLUP              (gpio_pinset_t){ PORT2, PIN6, (GPIO_INPUT | R_PFS_PCR)}

#define GPIO_P208_OUTPUT_HIGH               (gpio_pinset_t){ PORT2, PIN8, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_HIGH)}
#define GPIO_P208_OUTPUT_LOW                (gpio_pinset_t){ PORT2, PIN8, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_LOW)}
#define GPIO_P208_INPUT                     (gpio_pinset_t){ PORT2, PIN8, (GPIO_INPUT)}
#define GPIO_P208_INPUT_PULLUP              (gpio_pinset_t){ PORT2, PIN8, (GPIO_INPUT | R_PFS_PCR)}

#define GPIO_P209_OUTPUT_HIGH               (gpio_pinset_t){ PORT2, PIN9, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_HIGH)}
#define GPIO_P209_OUTPUT_LOW                (gpio_pinset_t){ PORT2, PIN9, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_LOW)}
#define GPIO_P209_INPUT                     (gpio_pinset_t){ PORT2, PIN9, (GPIO_INPUT)}
#define GPIO_P209_INPUT_PULLUP              (gpio_pinset_t){ PORT2, PIN9, (GPIO_INPUT | R_PFS_PCR)}

#define GPIO_P210_OUTPUT_HIGH               (gpio_pinset_t){ PORT2, PIN10, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_HIGH)}
#define GPIO_P210_OUTPUT_LOW                (gpio_pinset_t){ PORT2, PIN10, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_LOW)}
#define GPIO_P210_INPUT                     (gpio_pinset_t){ PORT2, PIN10, (GPIO_INPUT)}
#define GPIO_P210_INPUT_PULLUP              (gpio_pinset_t){ PORT2, PIN10, (GPIO_INPUT | R_PFS_PCR)}

#define GPIO_P211_OUTPUT_HIGH               (gpio_pinset_t){ PORT2, PIN11, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_HIGH)}
#define GPIO_P211_OUTPUT_LOW                (gpio_pinset_t){ PORT2, PIN11, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_LOW)}
#define GPIO_P211_INPUT                     (gpio_pinset_t){ PORT2, PIN11, (GPIO_INPUT)}
#define GPIO_P211_INPUT_PULLUP              (gpio_pinset_t){ PORT2, PIN11, (GPIO_INPUT | R_PFS_PCR)}

#define GPIO_P212_OUTPUT_HIGH               (gpio_pinset_t){ PORT2, PIN12, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_HIGH)}
#define GPIO_P212_OUTPUT_LOW                (gpio_pinset_t){ PORT2, PIN12, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_LOW)}
#define GPIO_P212_INPUT                     (gpio_pinset_t){ PORT2, PIN12, (GPIO_INPUT)}
#define GPIO_P212_INPUT_PULLUP              (gpio_pinset_t){ PORT2, PIN12, (GPIO_INPUT | R_PFS_PCR)}

#define GPIO_P213_OUTPUT_HIGH               (gpio_pinset_t){ PORT2, PIN13, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_HIGH)}
#define GPIO_P213_OUTPUT_LOW                (gpio_pinset_t){ PORT2, PIN13, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_LOW)}
#define GPIO_P213_INPUT                     (gpio_pinset_t){ PORT2, PIN13, (GPIO_INPUT)}
#define GPIO_P213_INPUT_PULLUP              (gpio_pinset_t){ PORT2, PIN13, (GPIO_INPUT | R_PFS_PCR)}

/* PORT 3 Pin Definitions */
#define GPIO_P300_OUTPUT_HIGH               (gpio_pinset_t){ PORT3, PIN0, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_HIGH)}
#define GPIO_P300_OUTPUT_LOW                (gpio_pinset_t){ PORT3, PIN0, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_LOW)}
#define GPIO_P300_INPUT                     (gpio_pinset_t){ PORT3, PIN0, (GPIO_INPUT)}
#define GPIO_P300_INPUT_PULLUP              (gpio_pinset_t){ PORT3, PIN0, (GPIO_INPUT | R_PFS_PCR)}

