nguyentri/nuttx/arch/arm/src/ra8/hardware/ra8e1/ra8e1_pinmap.h
#define GPIO_P301_OUTPUT_HIGH               (gpio_pinset_t){ PORT3, PIN1, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_HIGH)}
#define GPIO_P301_OUTPUT_LOW                (gpio_pinset_t){ PORT3, PIN1, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_LOW)}
#define GPIO_P301_INPUT                     (gpio_pinset_t){ PORT3, PIN1, (GPIO_INPUT)}
#define GPIO_P301_INPUT_PULLUP              (gpio_pinset_t){ PORT3, PIN1, (GPIO_INPUT | R_PFS_PCR)}

#define GPIO_P302_OUTPUT_HIGH               (gpio_pinset_t){ PORT3, PIN2, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_HIGH)}
#define GPIO_P302_OUTPUT_LOW                (gpio_pinset_t){ PORT3, PIN2, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_LOW)}
#define GPIO_P302_INPUT                     (gpio_pinset_t){ PORT3, PIN2, (GPIO_INPUT)}
#define GPIO_P302_INPUT_PULLUP              (gpio_pinset_t){ PORT3, PIN2, (GPIO_INPUT | R_PFS_PCR)}

#define GPIO_P304_OUTPUT_HIGH               (gpio_pinset_t){ PORT3, PIN4, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_HIGH)}
#define GPIO_P304_OUTPUT_LOW                (gpio_pinset_t){ PORT3, PIN4, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_LOW)}
#define GPIO_P304_INPUT                     (gpio_pinset_t){ PORT3, PIN4, (GPIO_INPUT)}
#define GPIO_P304_INPUT_PULLUP              (gpio_pinset_t){ PORT3, PIN4, (GPIO_INPUT | R_PFS_PCR)}

#define GPIO_P305_OUTPUT_HIGH               (gpio_pinset_t){ PORT3, PIN5, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_HIGH)}
#define GPIO_P305_OUTPUT_LOW                (gpio_pinset_t){ PORT3, PIN5, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_LOW)}
#define GPIO_P305_INPUT                     (gpio_pinset_t){ PORT3, PIN5, (GPIO_INPUT)}
#define GPIO_P305_INPUT_PULLUP              (gpio_pinset_t){ PORT3, PIN5, (GPIO_INPUT | R_PFS_PCR)}

#define GPIO_P306_OUTPUT_HIGH               (gpio_pinset_t){ PORT3, PIN6, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_HIGH)}
#define GPIO_P306_OUTPUT_LOW                (gpio_pinset_t){ PORT3, PIN6, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_LOW)}
#define GPIO_P306_INPUT                     (gpio_pinset_t){ PORT3, PIN6, (GPIO_INPUT)}
#define GPIO_P306_INPUT_PULLUP              (gpio_pinset_t){ PORT3, PIN6, (GPIO_INPUT | R_PFS_PCR)}

#define GPIO_P307_OUTPUT_HIGH               (gpio_pinset_t){ PORT3, PIN7, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_HIGH)}
#define GPIO_P307_OUTPUT_LOW                (gpio_pinset_t){ PORT3, PIN7, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_LOW)}
#define GPIO_P307_INPUT                     (gpio_pinset_t){ PORT3, PIN7, (GPIO_INPUT)}
#define GPIO_P307_INPUT_PULLUP              (gpio_pinset_t){ PORT3, PIN7, (GPIO_INPUT | R_PFS_PCR)}

#define GPIO_P308_OUTPUT_HIGH               (gpio_pinset_t){ PORT3, PIN8, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_HIGH)}
#define GPIO_P308_OUTPUT_LOW                (gpio_pinset_t){ PORT3, PIN8, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_LOW)}
#define GPIO_P308_INPUT                     (gpio_pinset_t){ PORT3, PIN8, (GPIO_INPUT)}
#define GPIO_P308_INPUT_PULLUP              (gpio_pinset_t){ PORT3, PIN8, (GPIO_INPUT | R_PFS_PCR)}

#define GPIO_P309_OUTPUT_HIGH               (gpio_pinset_t){ PORT3, PIN9, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_HIGH)}
#define GPIO_P309_OUTPUT_LOW                (gpio_pinset_t){ PORT3, PIN9, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_LOW)}
#define GPIO_P309_INPUT                     (gpio_pinset_t){ PORT3, PIN9, (GPIO_INPUT)}
#define GPIO_P309_INPUT_PULLUP              (gpio_pinset_t){ PORT3, PIN9, (GPIO_INPUT | R_PFS_PCR)}

#define GPIO_P310_OUTPUT_HIGH               (gpio_pinset_t){ PORT3, PIN10, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_HIGH)}
#define GPIO_P310_OUTPUT_LOW                (gpio_pinset_t){ PORT3, PIN10, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_LOW)}
#define GPIO_P310_INPUT                     (gpio_pinset_t){ PORT3, PIN10, (GPIO_INPUT)}
#define GPIO_P310_INPUT_PULLUP              (gpio_pinset_t){ PORT3, PIN10, (GPIO_INPUT | R_PFS_PCR)}

#define GPIO_P311_OUTPUT_HIGH               (gpio_pinset_t){ PORT3, PIN11, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_HIGH)}
#define GPIO_P311_OUTPUT_LOW                (gpio_pinset_t){ PORT3, PIN11, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_LOW)}
#define GPIO_P311_INPUT                     (gpio_pinset_t){ PORT3, PIN11, (GPIO_INPUT)}
#define GPIO_P311_INPUT_PULLUP              (gpio_pinset_t){ PORT3, PIN11, (GPIO_INPUT | R_PFS_PCR)}

#define GPIO_P312_OUTPUT_HIGH               (gpio_pinset_t){ PORT3, PIN12, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_HIGH)}
#define GPIO_P312_OUTPUT_LOW                (gpio_pinset_t){ PORT3, PIN12, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_LOW)}
#define GPIO_P312_INPUT                     (gpio_pinset_t){ PORT3, PIN12, (GPIO_INPUT)}
#define GPIO_P312_INPUT_PULLUP              (gpio_pinset_t){ PORT3, PIN12, (GPIO_INPUT | R_PFS_PCR)}

#define GPIO_P313_OUTPUT_HIGH               (gpio_pinset_t){ PORT3, PIN13, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_HIGH)}
#define GPIO_P313_OUTPUT_LOW                (gpio_pinset_t){ PORT3, PIN13, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_LOW)}
#define GPIO_P313_INPUT                     (gpio_pinset_t){ PORT3, PIN13, (GPIO_INPUT)}
#define GPIO_P313_INPUT_PULLUP              (gpio_pinset_t){ PORT3, PIN13, (GPIO_INPUT | R_PFS_PCR)}

/* Additional PORT 4, 5, 6, 7, 8, 9 Pin Definitions */
#define GPIO_P400_OUTPUT_HIGH               (gpio_pinset_t){ PORT4, PIN0, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_HIGH)}
#define GPIO_P400_OUTPUT_LOW                (gpio_pinset_t){ PORT4, PIN0, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_LOW)}
#define GPIO_P400_INPUT                     (gpio_pinset_t){ PORT4, PIN0, (GPIO_INPUT)}
#define GPIO_P400_INPUT_PULLUP              (gpio_pinset_t){ PORT4, PIN0, (GPIO_INPUT | R_PFS_PCR)}

#define GPIO_P401_OUTPUT_HIGH               (gpio_pinset_t){ PORT4, PIN1, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_HIGH)}
#define GPIO_P401_OUTPUT_LOW                (gpio_pinset_t){ PORT4, PIN1, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_LOW)}
#define GPIO_P401_INPUT                     (gpio_pinset_t){ PORT4, PIN1, (GPIO_INPUT)}
#define GPIO_P401_INPUT_PULLUP              (gpio_pinset_t){ PORT4, PIN1, (GPIO_INPUT | R_PFS_PCR)}

