nguyentri/nuttx/arch/arm/src/ra8/hardware/ra8e1/ra8e1_pinmap.h
#define GPIO_P402_OUTPUT_HIGH               (gpio_pinset_t){ PORT4, PIN2, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_HIGH)}
#define GPIO_P402_OUTPUT_LOW                (gpio_pinset_t){ PORT4, PIN2, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_LOW)}
#define GPIO_P402_INPUT                     (gpio_pinset_t){ PORT4, PIN2, (GPIO_INPUT)}
#define GPIO_P402_INPUT_PULLUP              (gpio_pinset_t){ PORT4, PIN2, (GPIO_INPUT | R_PFS_PCR)}

#define GPIO_P403_OUTPUT_HIGH               (gpio_pinset_t){ PORT4, PIN3, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_HIGH)}
#define GPIO_P403_OUTPUT_LOW                (gpio_pinset_t){ PORT4, PIN3, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_LOW)}
#define GPIO_P403_INPUT                     (gpio_pinset_t){ PORT4, PIN3, (GPIO_INPUT)}
#define GPIO_P403_INPUT_PULLUP              (gpio_pinset_t){ PORT4, PIN3, (GPIO_INPUT | R_PFS_PCR)}

#define GPIO_P405_OUTPUT_HIGH               (gpio_pinset_t){ PORT4, PIN5, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_HIGH)}
#define GPIO_P405_OUTPUT_LOW                (gpio_pinset_t){ PORT4, PIN5, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_LOW)}
#define GPIO_P405_INPUT                     (gpio_pinset_t){ PORT4, PIN5, (GPIO_INPUT)}
#define GPIO_P405_INPUT_PULLUP              (gpio_pinset_t){ PORT4, PIN5, (GPIO_INPUT | R_PFS_PCR)}

#define GPIO_P406_OUTPUT_HIGH               (gpio_pinset_t){ PORT4, PIN6, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_HIGH)}
#define GPIO_P406_OUTPUT_LOW                (gpio_pinset_t){ PORT4, PIN6, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_LOW)}
#define GPIO_P406_INPUT                     (gpio_pinset_t){ PORT4, PIN6, (GPIO_INPUT)}
#define GPIO_P406_INPUT_PULLUP              (gpio_pinset_t){ PORT4, PIN6, (GPIO_INPUT | R_PFS_PCR)}

#define GPIO_P407_OUTPUT_HIGH               (gpio_pinset_t){ PORT4, PIN7, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_HIGH)}
#define GPIO_P407_OUTPUT_LOW                (gpio_pinset_t){ PORT4, PIN7, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_LOW)}
#define GPIO_P407_INPUT                     (gpio_pinset_t){ PORT4, PIN7, (GPIO_INPUT)}
#define GPIO_P407_INPUT_PULLUP              (gpio_pinset_t){ PORT4, PIN7, (GPIO_INPUT | R_PFS_PCR)}

#define GPIO_P409_OUTPUT_HIGH               (gpio_pinset_t){ PORT4, PIN9, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_HIGH)}
#define GPIO_P409_OUTPUT_LOW                (gpio_pinset_t){ PORT4, PIN9, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_LOW)}
#define GPIO_P409_INPUT                     (gpio_pinset_t){ PORT4, PIN9, (GPIO_INPUT)}
#define GPIO_P409_INPUT_PULLUP              (gpio_pinset_t){ PORT4, PIN9, (GPIO_INPUT | R_PFS_PCR)}

#define GPIO_P410_OUTPUT_HIGH               (gpio_pinset_t){ PORT4, PIN10, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_HIGH)}
#define GPIO_P410_OUTPUT_LOW                (gpio_pinset_t){ PORT4, PIN10, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_LOW)}
#define GPIO_P410_INPUT                     (gpio_pinset_t){ PORT4, PIN10, (GPIO_INPUT)}
#define GPIO_P410_INPUT_PULLUP              (gpio_pinset_t){ PORT4, PIN10, (GPIO_INPUT | R_PFS_PCR)}

#define GPIO_P411_OUTPUT_HIGH               (gpio_pinset_t){ PORT4, PIN11, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_HIGH)}
#define GPIO_P411_OUTPUT_LOW                (gpio_pinset_t){ PORT4, PIN11, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_LOW)}
#define GPIO_P411_INPUT                     (gpio_pinset_t){ PORT4, PIN11, (GPIO_INPUT)}
#define GPIO_P411_INPUT_PULLUP              (gpio_pinset_t){ PORT4, PIN11, (GPIO_INPUT | R_PFS_PCR)}

#define GPIO_P412_OUTPUT_HIGH               (gpio_pinset_t){ PORT4, PIN12, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_HIGH)}
#define GPIO_P412_OUTPUT_LOW                (gpio_pinset_t){ PORT4, PIN12, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_LOW)}
#define GPIO_P412_INPUT                     (gpio_pinset_t){ PORT4, PIN12, (GPIO_INPUT)}
#define GPIO_P412_INPUT_PULLUP              (gpio_pinset_t){ PORT4, PIN12, (GPIO_INPUT | R_PFS_PCR)}

#define GPIO_P413_OUTPUT_HIGH               (gpio_pinset_t){ PORT4, PIN13, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_HIGH)}
#define GPIO_P413_OUTPUT_LOW                (gpio_pinset_t){ PORT4, PIN13, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_LOW)}
#define GPIO_P413_INPUT                     (gpio_pinset_t){ PORT4, PIN13, (GPIO_INPUT)}
#define GPIO_P413_INPUT_PULLUP              (gpio_pinset_t){ PORT4, PIN13, (GPIO_INPUT | R_PFS_PCR)}

#define GPIO_P414_OUTPUT_HIGH               (gpio_pinset_t){ PORT4, PIN14, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_HIGH)}
#define GPIO_P414_OUTPUT_LOW                (gpio_pinset_t){ PORT4, PIN14, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_LOW)}
#define GPIO_P414_INPUT                     (gpio_pinset_t){ PORT4, PIN14, (GPIO_INPUT)}
#define GPIO_P414_INPUT_PULLUP              (gpio_pinset_t){ PORT4, PIN14, (GPIO_INPUT | R_PFS_PCR)}

#define GPIO_P415_OUTPUT_HIGH               (gpio_pinset_t){ PORT4, PIN15, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_HIGH)}
#define GPIO_P415_OUTPUT_LOW                (gpio_pinset_t){ PORT4, PIN15, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_LOW)}
#define GPIO_P415_INPUT                     (gpio_pinset_t){ PORT4, PIN15, (GPIO_INPUT)}
#define GPIO_P415_INPUT_PULLUP              (gpio_pinset_t){ PORT4, PIN15, (GPIO_INPUT | R_PFS_PCR)}

#define GPIO_P511_OUTPUT_HIGH               (gpio_pinset_t){ PORT5, PIN11, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_HIGH)}
#define GPIO_P511_OUTPUT_LOW                (gpio_pinset_t){ PORT5, PIN11, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_LOW)}
#define GPIO_P511_INPUT                     (gpio_pinset_t){ PORT5, PIN11, (GPIO_INPUT)}
#define GPIO_P511_INPUT_PULLUP              (gpio_pinset_t){ PORT5, PIN11, (GPIO_INPUT | R_PFS_PCR)}

#define GPIO_P512_OUTPUT_HIGH               (gpio_pinset_t){ PORT5, PIN12, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_HIGH)}
#define GPIO_P512_OUTPUT_LOW                (gpio_pinset_t){ PORT5, PIN12, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_LOW)}
#define GPIO_P512_INPUT                     (gpio_pinset_t){ PORT5, PIN12, (GPIO_INPUT)}
#define GPIO_P512_INPUT_PULLUP              (gpio_pinset_t){ PORT5, PIN12, (GPIO_INPUT | R_PFS_PCR)}

#define GPIO_P513_OUTPUT_HIGH               (gpio_pinset_t){ PORT5, PIN13, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_HIGH)}
#define GPIO_P513_OUTPUT_LOW                (gpio_pinset_t){ PORT5, PIN13, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_LOW)}
#define GPIO_P513_INPUT                     (gpio_pinset_t){ PORT5, PIN13, (GPIO_INPUT)}
#define GPIO_P513_INPUT_PULLUP              (gpio_pinset_t){ PORT5, PIN13, (GPIO_INPUT | R_PFS_PCR)}

