nguyentri/nuttx/arch/arm/src/ra8/hardware/ra8e1/ra8e1_pinmap.h
#define GPIO_P600_OUTPUT_HIGH               (gpio_pinset_t){ PORT6, PIN0, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_HIGH)}
#define GPIO_P600_OUTPUT_LOW                (gpio_pinset_t){ PORT6, PIN0, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_LOW)}
#define GPIO_P600_INPUT                     (gpio_pinset_t){ PORT6, PIN0, (GPIO_INPUT)}
#define GPIO_P600_INPUT_PULLUP              (gpio_pinset_t){ PORT6, PIN0, (GPIO_INPUT | R_PFS_PCR)}

#define GPIO_P601_OUTPUT_HIGH               (gpio_pinset_t){ PORT6, PIN1, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_HIGH)}
#define GPIO_P601_OUTPUT_LOW                (gpio_pinset_t){ PORT6, PIN1, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_LOW)}
#define GPIO_P601_INPUT                     (gpio_pinset_t){ PORT6, PIN1, (GPIO_INPUT)}
#define GPIO_P601_INPUT_PULLUP              (gpio_pinset_t){ PORT6, PIN1, (GPIO_INPUT | R_PFS_PCR)}

#define GPIO_P602_OUTPUT_HIGH               (gpio_pinset_t){ PORT6, PIN2, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_HIGH)}
#define GPIO_P602_OUTPUT_LOW                (gpio_pinset_t){ PORT6, PIN2, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_LOW)}
#define GPIO_P602_INPUT                     (gpio_pinset_t){ PORT6, PIN2, (GPIO_INPUT)}
#define GPIO_P602_INPUT_PULLUP              (gpio_pinset_t){ PORT6, PIN2, (GPIO_INPUT | R_PFS_PCR)}

#define GPIO_P603_OUTPUT_HIGH               (gpio_pinset_t){ PORT6, PIN3, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_HIGH)}
#define GPIO_P603_OUTPUT_LOW                (gpio_pinset_t){ PORT6, PIN3, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_LOW)}
#define GPIO_P603_INPUT                     (gpio_pinset_t){ PORT6, PIN3, (GPIO_INPUT)}
#define GPIO_P603_INPUT_PULLUP              (gpio_pinset_t){ PORT6, PIN3, (GPIO_INPUT | R_PFS_PCR)}

#define GPIO_P604_OUTPUT_HIGH               (gpio_pinset_t){ PORT6, PIN4, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_HIGH)}
#define GPIO_P604_OUTPUT_LOW                (gpio_pinset_t){ PORT6, PIN4, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_LOW)}
#define GPIO_P604_INPUT                     (gpio_pinset_t){ PORT6, PIN4, (GPIO_INPUT)}
#define GPIO_P604_INPUT_PULLUP              (gpio_pinset_t){ PORT6, PIN4, (GPIO_INPUT | R_PFS_PCR)}

#define GPIO_P609_OUTPUT_HIGH               (gpio_pinset_t){ PORT6, PIN9, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_HIGH)}
#define GPIO_P609_OUTPUT_LOW                (gpio_pinset_t){ PORT6, PIN9, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_LOW)}
#define GPIO_P609_INPUT                     (gpio_pinset_t){ PORT6, PIN9, (GPIO_INPUT)}
#define GPIO_P609_INPUT_PULLUP              (gpio_pinset_t){ PORT6, PIN9, (GPIO_INPUT | R_PFS_PCR)}

#define GPIO_P610_OUTPUT_HIGH               (gpio_pinset_t){ PORT6, PIN10, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_HIGH)}
#define GPIO_P610_OUTPUT_LOW                (gpio_pinset_t){ PORT6, PIN10, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_LOW)}
#define GPIO_P610_INPUT                     (gpio_pinset_t){ PORT6, PIN10, (GPIO_INPUT)}
#define GPIO_P610_INPUT_PULLUP              (gpio_pinset_t){ PORT6, PIN10, (GPIO_INPUT | R_PFS_PCR)}

#define GPIO_P611_OUTPUT_HIGH               (gpio_pinset_t){ PORT6, PIN11, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_HIGH)}
#define GPIO_P611_OUTPUT_LOW                (gpio_pinset_t){ PORT6, PIN11, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_LOW)}
#define GPIO_P611_INPUT                     (gpio_pinset_t){ PORT6, PIN11, (GPIO_INPUT)}
#define GPIO_P611_INPUT_PULLUP              (gpio_pinset_t){ PORT6, PIN11, (GPIO_INPUT | R_PFS_PCR)}

#define GPIO_P612_OUTPUT_HIGH               (gpio_pinset_t){ PORT6, PIN12, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_HIGH)}
#define GPIO_P612_OUTPUT_LOW                (gpio_pinset_t){ PORT6, PIN12, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_LOW)}
#define GPIO_P612_INPUT                     (gpio_pinset_t){ PORT6, PIN12, (GPIO_INPUT)}
#define GPIO_P612_INPUT_PULLUP              (gpio_pinset_t){ PORT6, PIN12, (GPIO_INPUT | R_PFS_PCR)}

#define GPIO_P613_OUTPUT_HIGH               (gpio_pinset_t){ PORT6, PIN13, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_HIGH)}
#define GPIO_P613_OUTPUT_LOW                (gpio_pinset_t){ PORT6, PIN13, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_LOW)}
#define GPIO_P613_INPUT                     (gpio_pinset_t){ PORT6, PIN13, (GPIO_INPUT)}
#define GPIO_P613_INPUT_PULLUP              (gpio_pinset_t){ PORT6, PIN13, (GPIO_INPUT | R_PFS_PCR)}

#define GPIO_P614_OUTPUT_HIGH               (gpio_pinset_t){ PORT6, PIN14, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_HIGH)}
#define GPIO_P614_OUTPUT_LOW                (gpio_pinset_t){ PORT6, PIN14, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_LOW)}
#define GPIO_P614_INPUT                     (gpio_pinset_t){ PORT6, PIN14, (GPIO_INPUT)}
#define GPIO_P614_INPUT_PULLUP              (gpio_pinset_t){ PORT6, PIN14, (GPIO_INPUT | R_PFS_PCR)}

/* PORT 7 Pin Definitions */
#define GPIO_P700_OUTPUT_HIGH               (gpio_pinset_t){ PORT7, PIN0, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_HIGH)}
#define GPIO_P700_OUTPUT_LOW                (gpio_pinset_t){ PORT7, PIN0, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_LOW)}
#define GPIO_P700_INPUT                     (gpio_pinset_t){ PORT7, PIN0, (GPIO_INPUT)}
#define GPIO_P700_INPUT_PULLUP              (gpio_pinset_t){ PORT7, PIN0, (GPIO_INPUT | R_PFS_PCR)}

#define GPIO_P701_OUTPUT_HIGH               (gpio_pinset_t){ PORT7, PIN1, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_HIGH)}
#define GPIO_P701_OUTPUT_LOW                (gpio_pinset_t){ PORT7, PIN1, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_LOW)}
#define GPIO_P701_INPUT                     (gpio_pinset_t){ PORT7, PIN1, (GPIO_INPUT)}
#define GPIO_P701_INPUT_PULLUP              (gpio_pinset_t){ PORT7, PIN1, (GPIO_INPUT | R_PFS_PCR)}

#define GPIO_P702_OUTPUT_HIGH               (gpio_pinset_t){ PORT7, PIN2, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_HIGH)}
#define GPIO_P702_OUTPUT_LOW                (gpio_pinset_t){ PORT7, PIN2, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_LOW)}
#define GPIO_P702_INPUT                     (gpio_pinset_t){ PORT7, PIN2, (GPIO_INPUT)}
#define GPIO_P702_INPUT_PULLUP              (gpio_pinset_t){ PORT7, PIN2, (GPIO_INPUT | R_PFS_PCR)}

#define GPIO_P703_OUTPUT_HIGH               (gpio_pinset_t){ PORT7, PIN3, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_HIGH)}
#define GPIO_P703_OUTPUT_LOW                (gpio_pinset_t){ PORT7, PIN3, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_LOW)}
#define GPIO_P703_INPUT                     (gpio_pinset_t){ PORT7, PIN3, (GPIO_INPUT)}
#define GPIO_P703_INPUT_PULLUP              (gpio_pinset_t){ PORT7, PIN3, (GPIO_INPUT | R_PFS_PCR)}

