nguyentri/nuttx/arch/arm/src/ra8/hardware/ra8e1/ra8e1_pinmap.h
#define GPIO_P704_OUTPUT_HIGH               (gpio_pinset_t){ PORT7, PIN4, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_HIGH)}
#define GPIO_P704_OUTPUT_LOW                (gpio_pinset_t){ PORT7, PIN4, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_LOW)}
#define GPIO_P704_INPUT                     (gpio_pinset_t){ PORT7, PIN4, (GPIO_INPUT)}
#define GPIO_P704_INPUT_PULLUP              (gpio_pinset_t){ PORT7, PIN4, (GPIO_INPUT | R_PFS_PCR)}

#define GPIO_P705_OUTPUT_HIGH               (gpio_pinset_t){ PORT7, PIN5, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_HIGH)}
#define GPIO_P705_OUTPUT_LOW                (gpio_pinset_t){ PORT7, PIN5, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_LOW)}
#define GPIO_P705_INPUT                     (gpio_pinset_t){ PORT7, PIN5, (GPIO_INPUT)}
#define GPIO_P705_INPUT_PULLUP              (gpio_pinset_t){ PORT7, PIN5, (GPIO_INPUT | R_PFS_PCR)}

#define GPIO_P708_OUTPUT_HIGH               (gpio_pinset_t){ PORT7, PIN8, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_HIGH)}
#define GPIO_P708_OUTPUT_LOW                (gpio_pinset_t){ PORT7, PIN8, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_LOW)}
#define GPIO_P708_INPUT                     (gpio_pinset_t){ PORT7, PIN8, (GPIO_INPUT)}
#define GPIO_P708_INPUT_PULLUP              (gpio_pinset_t){ PORT7, PIN8, (GPIO_INPUT | R_PFS_PCR)}

#define GPIO_P709_OUTPUT_HIGH               (gpio_pinset_t){ PORT7, PIN9, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_HIGH)}
#define GPIO_P709_OUTPUT_LOW                (gpio_pinset_t){ PORT7, PIN9, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_LOW)}
#define GPIO_P709_INPUT                     (gpio_pinset_t){ PORT7, PIN9, (GPIO_INPUT)}
#define GPIO_P709_INPUT_PULLUP              (gpio_pinset_t){ PORT7, PIN9, (GPIO_INPUT | R_PFS_PCR)}

#define GPIO_P710_OUTPUT_HIGH               (gpio_pinset_t){ PORT7, PIN10, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_HIGH)}
#define GPIO_P710_OUTPUT_LOW                (gpio_pinset_t){ PORT7, PIN10, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_LOW)}
#define GPIO_P710_INPUT                     (gpio_pinset_t){ PORT7, PIN10, (GPIO_INPUT)}
#define GPIO_P710_INPUT_PULLUP              (gpio_pinset_t){ PORT7, PIN10, (GPIO_INPUT | R_PFS_PCR)}

#define GPIO_P711_OUTPUT_HIGH               (gpio_pinset_t){ PORT7, PIN11, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_HIGH)}
#define GPIO_P711_OUTPUT_LOW                (gpio_pinset_t){ PORT7, PIN11, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_LOW)}
#define GPIO_P711_INPUT                     (gpio_pinset_t){ PORT7, PIN11, (GPIO_INPUT)}
#define GPIO_P711_INPUT_PULLUP              (gpio_pinset_t){ PORT7, PIN11, (GPIO_INPUT | R_PFS_PCR)}

#define GPIO_P712_OUTPUT_HIGH               (gpio_pinset_t){ PORT7, PIN12, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_HIGH)}
#define GPIO_P712_OUTPUT_LOW                (gpio_pinset_t){ PORT7, PIN12, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_LOW)}
#define GPIO_P712_INPUT                     (gpio_pinset_t){ PORT7, PIN12, (GPIO_INPUT)}
#define GPIO_P712_INPUT_PULLUP              (gpio_pinset_t){ PORT7, PIN12, (GPIO_INPUT | R_PFS_PCR)}

#define GPIO_P713_OUTPUT_HIGH               (gpio_pinset_t){ PORT7, PIN13, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_HIGH)}
#define GPIO_P713_OUTPUT_LOW                (gpio_pinset_t){ PORT7, PIN13, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_LOW)}
#define GPIO_P713_INPUT                     (gpio_pinset_t){ PORT7, PIN13, (GPIO_INPUT)}
#define GPIO_P713_INPUT_PULLUP              (gpio_pinset_t){ PORT7, PIN13, (GPIO_INPUT | R_PFS_PCR)}

/* PORT 8 Pin Definitions */
#define GPIO_P800_OUTPUT_HIGH               (gpio_pinset_t){ PORT8, PIN0, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_HIGH)}
#define GPIO_P800_OUTPUT_LOW                (gpio_pinset_t){ PORT8, PIN0, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_LOW)}
#define GPIO_P800_INPUT                     (gpio_pinset_t){ PORT8, PIN0, (GPIO_INPUT)}
#define GPIO_P800_INPUT_PULLUP              (gpio_pinset_t){ PORT8, PIN0, (GPIO_INPUT | R_PFS_PCR)}

#define GPIO_P801_OUTPUT_HIGH               (gpio_pinset_t){ PORT8, PIN1, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_HIGH)}
#define GPIO_P801_OUTPUT_LOW                (gpio_pinset_t){ PORT8, PIN1, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_LOW)}
#define GPIO_P801_INPUT                     (gpio_pinset_t){ PORT8, PIN1, (GPIO_INPUT)}
#define GPIO_P801_INPUT_PULLUP              (gpio_pinset_t){ PORT8, PIN1, (GPIO_INPUT | R_PFS_PCR)}

#define GPIO_P802_OUTPUT_HIGH               (gpio_pinset_t){ PORT8, PIN2, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_HIGH)}
#define GPIO_P802_OUTPUT_LOW                (gpio_pinset_t){ PORT8, PIN2, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_LOW)}
#define GPIO_P802_INPUT                     (gpio_pinset_t){ PORT8, PIN2, (GPIO_INPUT)}
#define GPIO_P802_INPUT_PULLUP              (gpio_pinset_t){ PORT8, PIN2, (GPIO_INPUT | R_PFS_PCR)}

#define GPIO_P803_OUTPUT_HIGH               (gpio_pinset_t){ PORT8, PIN3, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_HIGH)}
#define GPIO_P803_OUTPUT_LOW                (gpio_pinset_t){ PORT8, PIN3, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_LOW)}
#define GPIO_P803_INPUT                     (gpio_pinset_t){ PORT8, PIN3, (GPIO_INPUT)}
#define GPIO_P803_INPUT_PULLUP              (gpio_pinset_t){ PORT8, PIN3, (GPIO_INPUT | R_PFS_PCR)}

#define GPIO_P804_OUTPUT_HIGH               (gpio_pinset_t){ PORT8, PIN4, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_HIGH)}
#define GPIO_P804_OUTPUT_LOW                (gpio_pinset_t){ PORT8, PIN4, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_LOW)}
#define GPIO_P804_INPUT                     (gpio_pinset_t){ PORT8, PIN4, (GPIO_INPUT)}
#define GPIO_P804_INPUT_PULLUP              (gpio_pinset_t){ PORT8, PIN4, (GPIO_INPUT | R_PFS_PCR)}

#define GPIO_P805_OUTPUT_HIGH               (gpio_pinset_t){ PORT8, PIN5, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_HIGH)}
#define GPIO_P805_OUTPUT_LOW                (gpio_pinset_t){ PORT8, PIN5, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_LOW)}
#define GPIO_P805_INPUT                     (gpio_pinset_t){ PORT8, PIN5, (GPIO_INPUT)}
#define GPIO_P805_INPUT_PULLUP              (gpio_pinset_t){ PORT8, PIN5, (GPIO_INPUT | R_PFS_PCR)}

