nguyentri/nuttx/arch/arm/src/ra8/hardware/ra8e1/ra8e1_pinmap.h
#define GPIO_P806_OUTPUT_HIGH               (gpio_pinset_t){ PORT8, PIN6, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_HIGH)}
#define GPIO_P806_OUTPUT_LOW                (gpio_pinset_t){ PORT8, PIN6, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_LOW)}
#define GPIO_P806_INPUT                     (gpio_pinset_t){ PORT8, PIN6, (GPIO_INPUT)}
#define GPIO_P806_INPUT_PULLUP              (gpio_pinset_t){ PORT8, PIN6, (GPIO_INPUT | R_PFS_PCR)}

#define GPIO_P808_OUTPUT_HIGH               (gpio_pinset_t){ PORT8, PIN8, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_HIGH)}
#define GPIO_P808_OUTPUT_LOW                (gpio_pinset_t){ PORT8, PIN8, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_LOW)}
#define GPIO_P808_INPUT                     (gpio_pinset_t){ PORT8, PIN8, (GPIO_INPUT)}
#define GPIO_P808_INPUT_PULLUP              (gpio_pinset_t){ PORT8, PIN8, (GPIO_INPUT | R_PFS_PCR)}

#define GPIO_P809_OUTPUT_HIGH               (gpio_pinset_t){ PORT8, PIN9, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_HIGH)}
#define GPIO_P809_OUTPUT_LOW                (gpio_pinset_t){ PORT8, PIN9, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_LOW)}
#define GPIO_P809_INPUT                     (gpio_pinset_t){ PORT8, PIN9, (GPIO_INPUT)}
#define GPIO_P809_INPUT_PULLUP              (gpio_pinset_t){ PORT8, PIN9, (GPIO_INPUT | R_PFS_PCR)}

#define GPIO_P814_OUTPUT_HIGH               (gpio_pinset_t){ PORT8, PIN14, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_HIGH)}
#define GPIO_P814_OUTPUT_LOW                (gpio_pinset_t){ PORT8, PIN14, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_LOW)}
#define GPIO_P814_INPUT                     (gpio_pinset_t){ PORT8, PIN14, (GPIO_INPUT)}
#define GPIO_P814_INPUT_PULLUP              (gpio_pinset_t){ PORT8, PIN14, (GPIO_INPUT | R_PFS_PCR)}

#define GPIO_P815_OUTPUT_HIGH               (gpio_pinset_t){ PORT8, PIN15, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_HIGH)}
#define GPIO_P815_OUTPUT_LOW                (gpio_pinset_t){ PORT8, PIN15, (GPIO_OUTPUT | GPIO_LOW_DRIVE | GPIO_OUTPUT_LOW)}
#define GPIO_P815_INPUT                     (gpio_pinset_t){ PORT8, PIN15, (GPIO_INPUT)}
#define GPIO_P815_INPUT_PULLUP              (gpio_pinset_t){ PORT8, PIN15, (GPIO_INPUT | R_PFS_PCR)}

/* GPIO Configuration */

#define GPIO_OUTPUT               R_PFS_PDR
#define GPIO_INPUT               ~(R_PFS_PDR | 0xFFFFFFFF)

#define GPIO_LOW_DRIVE          ~(R_PFS_DSCR | 0xFFFFFFFF)
#define GPIO_MIDDLE_DRIVE       R_PFS_DSCR

#define GPIO_OUTPUT_HIGH         R_PFS_PODR
#define GPIO_OUTPUT_LOW         ~(R_PFS_PODR | 0xFFFFFFFF)

/****************************************************************************
 * Public Types
 ****************************************************************************/

/****************************************************************************
 * Public Data
 ****************************************************************************/

/****************************************************************************
 * Public Functions Prototypes
 ****************************************************************************/

#endif /* __ARCH_ARM_SRC_RA_HARDWARE_RA8E1_PINMAP_H */
